Repository: OBI-GRIPO/e-filing
Catalog: applications/WordPress/themes/OBI/languages/*.po
Languages: el

source: Home
el: Αρχική

source: Connect
el: Συνδεθήκατε με

source: Applications
el: Αιτήσεις

source: Help
el: Οδηγίες

source: OBI
el: ΟΒΙ

source: Submissions
el: Υποβληθείσες Αιτήσεις

source: Logout
el: Έξοδος

source: Electronic submission of applications
el: Ηλεκτρονική υποβολή αιτήσεων

source: Submit forms easyly
el: Ευκολή αποστολή

source: Back to top
el: Επιστροφή
