<?php
header('Access-Control-Allow-Origin: *');
header('Access-Control-Allow-Headers: *');
header('Access-Control-Allow-Methods: GET, OPTIONS');
header('Content-type: application/json');
header('Cache-Control: no-cache, must-revalidate');




if ($_SERVER['REQUEST_METHOD'] === 'OPTIONS') {
	exit;
} else
if ($_SERVER['REQUEST_METHOD'] === 'GET') {
	
$ref = $_SERVER['HTTP_REFERER'];
$refData = parse_url($ref);

if($refData['host'] !== 'formio-api'&&$refData['host'] !== 'efiling.obi.gr') { //TODO allow internal obi network
	    $data['status']="error";
	    $data['error']="not in net";
		$data["Forbidden"] = 1;
		header("HTTP/1.1 403 Forbidden");
		die(json_encode($data));	
}
	
$tks=json_decode('
[
  {
    "zip": "31 100",
    "city": "ΛΕΥΚΑΔΑ"
  },
  {
    "zip": "104 31",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 32",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 33",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 34",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 35",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 36",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 37",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 38",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 39",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 40",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 41",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 42",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 43",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 44",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 45",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 46",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "104 47",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 51",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 52",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 53",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 54",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 55",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 56",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 57",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 58",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 59",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 60",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 61",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 62",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 63",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "105 64",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 71",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 72",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 73",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 74",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 75",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 76",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 77",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 78",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 79",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 80",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 81",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 82",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "106 83",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "111 41",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "111 42",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "111 43",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "111 44",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "111 45",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "111 46",
    "city": "ΓΑΛΑΤΣΙ"
  },
  {
    "zip": "111 47",
    "city": "ΓΑΛΑΤΣΙ"
  },
  {
    "zip": "112 51",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "112 52",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "112 53",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "112 54",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "112 55",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "112 56",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "112 57",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "113 61",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "113 62",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "113 63",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "113 64",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "114 71",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "114 72",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "114 73",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "114 74",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "114 75",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "114 76",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "115 21",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "115 22",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "115 23",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "115 24",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "115 25",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "115 26",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "115 27",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "115 28",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "116 31",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "116 32",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "116 33",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "116 34",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "116 35",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "116 36",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "117 41",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "117 42",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "117 43",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "117 44",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "117 45",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "118 51",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "118 52",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "118 53",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "118 54",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "118 55",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "121 31",
    "city": "ΠΕΡΙΣΤΕΡΙ"
  },
  {
    "zip": "121 32",
    "city": "ΠΕΡΙΣΤΕΡΙ"
  },
  {
    "zip": "121 33",
    "city": "ΠΕΡΙΣΤΕΡΙ"
  },
  {
    "zip": "121 34",
    "city": "ΠΕΡΙΣΤΕΡΙ"
  },
  {
    "zip": "121 35",
    "city": "ΠΕΡΙΣΤΕΡΙ"
  },
  {
    "zip": "121 36",
    "city": "ΠΕΡΙΣΤΕΡΙ"
  },
  {
    "zip": "121 37",
    "city": "ΠΕΡΙΣΤΕΡΙ"
  },
  {
    "zip": "122 41",
    "city": "ΑΙΓΑΛΕΩ"
  },
  {
    "zip": "122 42",
    "city": "ΑΙΓΑΛΕΩ"
  },
  {
    "zip": "122 43",
    "city": "ΑΙΓΑΛΕΩ"
  },
  {
    "zip": "122 44",
    "city": "ΑΙΓΑΛΕΩ"
  },
  {
    "zip": "123 51",
    "city": "ΑΓΙΑ ΒΑΡΒΑΡΑ"
  },
  {
    "zip": "124 61",
    "city": "ΧΑΪΔΑΡΙ"
  },
  {
    "zip": "124 62",
    "city": "ΧΑΪΔΑΡΙ"
  },
  {
    "zip": "131 21",
    "city": "ΙΛΙΟΝ"
  },
  {
    "zip": "131 22",
    "city": "ΙΛΙΟΝ"
  },
  {
    "zip": "131 23",
    "city": "ΙΛΙΟΝ"
  },
  {
    "zip": "132 31",
    "city": "ΠΕΤΡΟΥΠΟΛΗ"
  },
  {
    "zip": "132 32",
    "city": "ΠΕΤΡΟΥΠΟΛΗ"
  },
  {
    "zip": "133 41",
    "city": "ΑΝΩ ΛΙΟΣΙΑ"
  },
  {
    "zip": "133 42",
    "city": "ΑΝΩ ΛΙΟΣΙΑ"
  },
  {
    "zip": "133 43",
    "city": "ΑΝΩ ΛΙΟΣΙΑ"
  },
  {
    "zip": "133 44",
    "city": "ΑΝΩ ΛΙΟΣΙΑ"
  },
  {
    "zip": "133 51",
    "city": "ΦΥΛΗ"
  },
  {
    "zip": "134 51",
    "city": "ΚΑΜΑΤΕΡΟ"
  },
  {
    "zip": "134 61",
    "city": "ΖΕΦΥΡΙ"
  },
  {
    "zip": "135 61",
    "city": "ΑΓΙΟΙ ΑΝΑΡΓΥΡΟΙ"
  },
  {
    "zip": "135 62",
    "city": "ΑΓΙΟΙ ΑΝΑΡΓΥΡΟΙ"
  },
  {
    "zip": "136 71",
    "city": "ΑΧΑΡΝΕΣ"
  },
  {
    "zip": "136 72",
    "city": "ΑΧΑΡΝΕΣ"
  },
  {
    "zip": "136 73",
    "city": "ΑΧΑΡΝΕΣ"
  },
  {
    "zip": "136 74",
    "city": "ΑΧΑΡΝΕΣ"
  },
  {
    "zip": "136 75",
    "city": "ΑΧΑΡΝΕΣ"
  },
  {
    "zip": "136 76",
    "city": "ΘΡΑΚΟΜΑΚΕΔΟΝΕΣ"
  },
  {
    "zip": "136 77",
    "city": "ΑΧΑΡΝΕΣ"
  },
  {
    "zip": "136 78",
    "city": "ΑΧΑΡΝΕΣ"
  },
  {
    "zip": "136 79",
    "city": "ΑΧΑΡΝΕΣ"
  },
  {
    "zip": "141 21",
    "city": "ΗΡΑΚΛΕΙΟ ΑΤΤΙΚΗΣ"
  },
  {
    "zip": "141 22",
    "city": "ΗΡΑΚΛΕΙΟ ΑΤΤΙΚΗΣ"
  },
  {
    "zip": "141 23",
    "city": "ΛΥΚΟΒΡΥΣΗ"
  },
  {
    "zip": "142 31",
    "city": "ΝΕΑ ΙΩΝΙΑ ΑΤΤΙΚΗΣ"
  },
  {
    "zip": "142 32",
    "city": "ΝΕΑ ΙΩΝΙΑ ΑΤΤΙΚΗΣ"
  },
  {
    "zip": "142 33",
    "city": "ΝΕΑ ΙΩΝΙΑ ΑΤΤΙΚΗΣ"
  },
  {
    "zip": "142 34",
    "city": "ΝΕΑ ΙΩΝΙΑ ΑΤΤΙΚΗΣ"
  },
  {
    "zip": "142 35",
    "city": "ΝΕΑ ΙΩΝΙΑ ΑΤΤΙΚΗΣ"
  },
  {
    "zip": "143 41",
    "city": "ΝΕΑ ΦΙΛΑΔΕΛΦΕΙΑ"
  },
  {
    "zip": "143 42",
    "city": "ΝΕΑ ΦΙΛΑΔΕΛΦΕΙΑ"
  },
  {
    "zip": "143 43",
    "city": "ΝΕΑ ΧΑΛΚΗΔΟΝΑ"
  },
  {
    "zip": "144 51",
    "city": "ΜΕΤΑΜΟΡΦΩΣΗ"
  },
  {
    "zip": "144 52",
    "city": "ΜΕΤΑΜΟΡΦΩΣΗ"
  },
  {
    "zip": "145 61",
    "city": "ΚΗΦΙΣΙΑ"
  },
  {
    "zip": "145 62",
    "city": "ΚΗΦΙΣΙΑ"
  },
  {
    "zip": "145 63",
    "city": "ΚΗΦΙΣΙΑ"
  },
  {
    "zip": "145 64",
    "city": "ΚΗΦΙΣΙΑ"
  },
  {
    "zip": "145 65",
    "city": "ΑΓΙΟΣ ΣΤΕΦΑΝΟΣ"
  },
  {
    "zip": "145 68",
    "city": "ΚΡΥΟΝΕΡΙ"
  },
  {
    "zip": "145 69",
    "city": "ΑΝΟΙΞΗ"
  },
  {
    "zip": "145 72",
    "city": "ΔΡΟΣΙΑ"
  },
  {
    "zip": "145 74",
    "city": "ΡΟΔΟΠΟΛΗ"
  },
  {
    "zip": "145 75",
    "city": "ΣΤΑΜΑΤΑ"
  },
  {
    "zip": "145 76",
    "city": "ΔΙΟΝΥΣΟΣ"
  },
  {
    "zip": "145 78",
    "city": "ΕΚΑΛΗ"
  },
  {
    "zip": "146 71",
    "city": "ΝΕΑ ΕΡΥΘΡΑΙΑ"
  },
  {
    "zip": "151 21",
    "city": "ΠΕΥΚΗ"
  },
  {
    "zip": "151 22",
    "city": "ΜΑΡΟΥΣΙ"
  },
  {
    "zip": "151 23",
    "city": "ΜΑΡΟΥΣΙ"
  },
  {
    "zip": "151 24",
    "city": "ΜΑΡΟΥΣΙ"
  },
  {
    "zip": "151 25",
    "city": "ΜΑΡΟΥΣΙ"
  },
  {
    "zip": "151 26",
    "city": "ΜΑΡΟΥΣΙ"
  },
  {
    "zip": "151 27",
    "city": "ΜΕΛΙΣΣΙΑ"
  },
  {
    "zip": "152 31",
    "city": "ΧΑΛΑΝΔΡΙ"
  },
  {
    "zip": "152 32",
    "city": "ΧΑΛΑΝΔΡΙ"
  },
  {
    "zip": "152 33",
    "city": "ΧΑΛΑΝΔΡΙ"
  },
  {
    "zip": "152 34",
    "city": "ΧΑΛΑΝΔΡΙ"
  },
  {
    "zip": "152 35",
    "city": "ΒΡΙΛΗΣΣΙΑ"
  },
  {
    "zip": "152 36",
    "city": "ΠΕΝΤΕΛΗ"
  },
  {
    "zip": "152 37",
    "city": "ΦΙΛΟΘΕΗ"
  },
  {
    "zip": "152 38",
    "city": "ΧΑΛΑΝΔΡΙ"
  },
  {
    "zip": "152 39",
    "city": "ΝΕΑ ΠΕΝΤΕΛΗ"
  },
  {
    "zip": "153 41",
    "city": "ΑΓΙΑ ΠΑΡΑΣΚΕΥΗ"
  },
  {
    "zip": "153 42",
    "city": "ΑΓΙΑ ΠΑΡΑΣΚΕΥΗ"
  },
  {
    "zip": "153 43",
    "city": "ΑΓΙΑ ΠΑΡΑΣΚΕΥΗ"
  },
  {
    "zip": "153 44",
    "city": "ΓΕΡΑΚΑΣ"
  },
  {
    "zip": "153 49",
    "city": "ΑΝΘΟΥΣΑ"
  },
  {
    "zip": "153 51",
    "city": "ΠΑΛΛΗΝΗ"
  },
  {
    "zip": "153 54",
    "city": "ΓΛΥΚΑ ΝΕΡΑ"
  },
  {
    "zip": "154 51",
    "city": "ΝΕΟ ΨΥΧΙΚΟ"
  },
  {
    "zip": "154 52",
    "city": "ΨΥΧΙΚΟ"
  },
  {
    "zip": "155 61",
    "city": "ΧΟΛΑΡΓΟΣ"
  },
  {
    "zip": "155 62",
    "city": "ΧΟΛΑΡΓΟΣ"
  },
  {
    "zip": "156 69",
    "city": "ΠΑΠΑΓΟΣ"
  },
  {
    "zip": "157 71",
    "city": "ΖΩΓΡΑΦΟΣ"
  },
  {
    "zip": "157 72",
    "city": "ΖΩΓΡΑΦΟΣ"
  },
  {
    "zip": "157 73",
    "city": "ΖΩΓΡΑΦΟΣ"
  },
  {
    "zip": "161 21",
    "city": "ΑΘΗΝΑ"
  },
  {
    "zip": "161 21",
    "city": "ΚΑΙΣΑΡΙΑΝΗ"
  },
  {
    "zip": "161 22",
    "city": "ΚΑΙΣΑΡΙΑΝΗ"
  },
  {
    "zip": "162 31",
    "city": "ΒΥΡΩΝΑΣ"
  },
  {
    "zip": "162 32",
    "city": "ΒΥΡΩΝΑΣ"
  },
  {
    "zip": "162 33",
    "city": "ΒΥΡΩΝΑΣ"
  },
  {
    "zip": "163 41",
    "city": "ΗΛΙΟΥΠΟΛΗ"
  },
  {
    "zip": "163 42",
    "city": "ΗΛΙΟΥΠΟΛΗ"
  },
  {
    "zip": "163 43",
    "city": "ΗΛΙΟΥΠΟΛΗ"
  },
  {
    "zip": "163 44",
    "city": "ΗΛΙΟΥΠΟΛΗ"
  },
  {
    "zip": "163 45",
    "city": "ΗΛΙΟΥΠΟΛΗ"
  },
  {
    "zip": "163 46",
    "city": "ΗΛΙΟΥΠΟΛΗ"
  },
  {
    "zip": "164 51",
    "city": "ΑΡΓΥΡΟΥΠΟΛΗ"
  },
  {
    "zip": "164 52",
    "city": "ΑΡΓΥΡΟΥΠΟΛΗ"
  },
  {
    "zip": "165 61",
    "city": "ΓΛΥΦΑΔΑ"
  },
  {
    "zip": "165 62",
    "city": "ΓΛΥΦΑΔΑ"
  },
  {
    "zip": "166 71",
    "city": "ΒΟΥΛΙΑΓΜΕΝΗ"
  },
  {
    "zip": "166 72",
    "city": "ΒΑΡΗ"
  },
  {
    "zip": "166 73",
    "city": "ΒΟΥΛΑ"
  },
  {
    "zip": "166 74",
    "city": "ΓΛΥΦΑΔΑ"
  },
  {
    "zip": "166 75",
    "city": "ΓΛΥΦΑΔΑ"
  },
  {
    "zip": "167 77",
    "city": "ΕΛΛΗΝΙΚΟ"
  },
  {
    "zip": "171 21",
    "city": "ΝΕΑ ΣΜΥΡΝΗ"
  },
  {
    "zip": "171 22",
    "city": "ΝΕΑ ΣΜΥΡΝΗ"
  },
  {
    "zip": "171 23",
    "city": "ΝΕΑ ΣΜΥΡΝΗ"
  },
  {
    "zip": "171 24",
    "city": "ΝΕΑ ΣΜΥΡΝΗ"
  },
  {
    "zip": "172 34",
    "city": "ΔΑΦΝΗ"
  },
  {
    "zip": "172 35",
    "city": "ΔΑΦΝΗ"
  },
  {
    "zip": "172 36",
    "city": "ΑΓΙΟΣ ΔΗΜΗΤΡΙΟΣ"
  },
  {
    "zip": "172 36",
    "city": "ΔΑΦΝΗ"
  },
  {
    "zip": "172 36",
    "city": "ΥΜΗΤΤΟΣ"
  },
  {
    "zip": "172 37",
    "city": "ΔΑΦΝΗ"
  },
  {
    "zip": "172 37",
    "city": "ΥΜΗΤΤΟΣ"
  },
  {
    "zip": "173 41",
    "city": "ΑΓΙΟΣ ΔΗΜΗΤΡΙΟΣ"
  },
  {
    "zip": "173 42",
    "city": "ΑΓΙΟΣ ΔΗΜΗΤΡΙΟΣ"
  },
  {
    "zip": "173 43",
    "city": "ΑΓΙΟΣ ΔΗΜΗΤΡΙΟΣ"
  },
  {
    "zip": "174 55",
    "city": "ΑΛΙΜΟΣ"
  },
  {
    "zip": "174 56",
    "city": "ΑΛΙΜΟΣ"
  },
  {
    "zip": "175 61",
    "city": "ΠΑΛΑΙΟ ΦΑΛΗΡΟ"
  },
  {
    "zip": "175 62",
    "city": "ΠΑΛΑΙΟ ΦΑΛΗΡΟ"
  },
  {
    "zip": "175 63",
    "city": "ΠΑΛΑΙΟ ΦΑΛΗΡΟ"
  },
  {
    "zip": "175 64",
    "city": "ΠΑΛΑΙΟ ΦΑΛΗΡΟ"
  },
  {
    "zip": "176 71",
    "city": "ΚΑΛΛΙΘΕΑ"
  },
  {
    "zip": "176 72",
    "city": "ΚΑΛΛΙΘΕΑ"
  },
  {
    "zip": "176 73",
    "city": "ΚΑΛΛΙΘΕΑ"
  },
  {
    "zip": "176 74",
    "city": "ΚΑΛΛΙΘΕΑ"
  },
  {
    "zip": "176 75",
    "city": "ΚΑΛΛΙΘΕΑ"
  },
  {
    "zip": "176 76",
    "city": "ΚΑΛΛΙΘΕΑ"
  },
  {
    "zip": "177 78",
    "city": "ΤΑΥΡΟΣ"
  },
  {
    "zip": "180 10",
    "city": "ΑΙΓΙΝΑ"
  },
  {
    "zip": "180 20",
    "city": "ΠΟΡΟΣ ΤΡΟΙΖΗΝΙΑΣ"
  },
  {
    "zip": "180 30",
    "city": "ΜΕΘΑΝΑ"
  },
  {
    "zip": "180 40",
    "city": "ΥΔΡΑ"
  },
  {
    "zip": "180 50",
    "city": "ΣΠΕΤΣΕΣ"
  },
  {
    "zip": "181 20",
    "city": "ΚΟΡΥΔΑΛΛΟΣ"
  },
  {
    "zip": "181 21",
    "city": "ΚΟΡΥΔΑΛΛΟΣ"
  },
  {
    "zip": "181 22",
    "city": "ΚΟΡΥΔΑΛΛΟΣ"
  },
  {
    "zip": "182 33",
    "city": "ΑΓΙΟΣ ΙΩΑΝΝΗΣ ΡΕΝΤΗΣ"
  },
  {
    "zip": "183 44",
    "city": "ΜΟΣΧΑΤΟ"
  },
  {
    "zip": "183 45",
    "city": "ΜΟΣΧΑΤΟ"
  },
  {
    "zip": "183 46",
    "city": "ΜΟΣΧΑΤΟ"
  },
  {
    "zip": "184 50",
    "city": "ΝΙΚΑΙΑ"
  },
  {
    "zip": "184 51",
    "city": "ΝΙΚΑΙΑ"
  },
  {
    "zip": "184 52",
    "city": "ΝΙΚΑΙΑ"
  },
  {
    "zip": "184 53",
    "city": "ΝΙΚΑΙΑ"
  },
  {
    "zip": "184 54",
    "city": "ΝΙΚΑΙΑ"
  },
  {
    "zip": "185 31",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 32",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 33",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 34",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 35",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 36",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 37",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 38",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 39",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 40",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 41",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 42",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 43",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 44",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 45",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 46",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "185 47",
    "city": "ΠΕΙΡΑΙΑΣ"
  },
  {
    "zip": "186 48",
    "city": "ΔΡΑΠΕΤΣΩΝΑ"
  },
  {
    "zip": "187 55",
    "city": "ΚΕΡΑΤΣΙΝΙ"
  },
  {
    "zip": "187 56",
    "city": "ΚΕΡΑΤΣΙΝΙ"
  },
  {
    "zip": "187 57",
    "city": "ΚΕΡΑΤΣΙΝΙ"
  },
  {
    "zip": "187 58",
    "city": "ΚΕΡΑΤΣΙΝΙ"
  },
  {
    "zip": "188 63",
    "city": "ΠΕΡΑΜΑ"
  },
  {
    "zip": "189 00",
    "city": "ΣΑΛΑΜΙΝΑ"
  },
  {
    "zip": "189 50",
    "city": "ΣΑΛΑΜΙΝΑ"
  },
  {
    "zip": "190 01",
    "city": "ΚΕΡΑΤΕΑ"
  },
  {
    "zip": "190 02",
    "city": "ΠΑΙΑΝΙΑ"
  },
  {
    "zip": "190 03",
    "city": "ΜΑΡΚΟΠΟΥΛΟ"
  },
  {
    "zip": "190 04",
    "city": "ΣΠΑΤΑ"
  },
  {
    "zip": "190 05",
    "city": "ΝΕΑ ΜΑΚΡΗ"
  },
  {
    "zip": "190 06",
    "city": "ΝΕΑ ΠΕΡΑΜΟΣ ΑΤΤΙΚΗΣ"
  },
  {
    "zip": "190 07",
    "city": "ΜΑΡΑΘΩΝΑΣ"
  },
  {
    "zip": "190 08",
    "city": "ΕΡΥΘΡΕΣ"
  },
  {
    "zip": "190 09",
    "city": "ΡΑΦΗΝΑ"
  },
  {
    "zip": "190 10",
    "city": "ΚΑΛΥΒΙΑ ΘΟΡΙΚΟΥ"
  },
  {
    "zip": "190 11",
    "city": "ΑΥΛΩΝΑ"
  },
  {
    "zip": "190 12",
    "city": "ΒΙΛΙΑ"
  },
  {
    "zip": "190 13",
    "city": "ΑΝΑΒΥΣΣΟΣ"
  },
  {
    "zip": "190 14",
    "city": "ΚΑΠΑΝΔΡΙΤΙ"
  },
  {
    "zip": "190 15",
    "city": "ΩΡΩΠΟΣ"
  },
  {
    "zip": "190 16",
    "city": "ΑΡΤΕΜΙΔΑ"
  },
  {
    "zip": "190 18",
    "city": "ΜΑΓΟΥΛΑ"
  },
  {
    "zip": "190 20",
    "city": "ΚΑΛΥΒΙΑ ΘΟΡΙΚΟΥ"
  },
  {
    "zip": "190 23",
    "city": "ΜΑΡΚΟΠΟΥΛΟ"
  },
  {
    "zip": "191 00",
    "city": "ΜΕΓΑΡΑ"
  },
  {
    "zip": "192 00",
    "city": "ΕΛΕΥΣΙΝΑ"
  },
  {
    "zip": "193 00",
    "city": "ΑΣΠΡΟΠΥΡΓΟΣ"
  },
  {
    "zip": "194 41",
    "city": "ΚΟΡΩΠΙ"
  },
  {
    "zip": "194 42",
    "city": "ΚΟΡΩΠΙ"
  },
  {
    "zip": "194 43",
    "city": "ΚΟΡΩΠΙ"
  },
  {
    "zip": "195 00",
    "city": "ΛΑΥΡΙΟ"
  },
  {
    "zip": "196 00",
    "city": "ΜΑΝΔΡΑ"
  },
  {
    "zip": "200 03",
    "city": "ΑΓΙΟΙ ΘΕΟΔΩΡΟΙ"
  },
  {
    "zip": "200 04",
    "city": "ΣΟΦΙΚΟ"
  },
  {
    "zip": "200 06",
    "city": "ΒΡΑΧΑΤΙ"
  },
  {
    "zip": "200 08",
    "city": "ΧΙΛΙΟΜΟΔΙ"
  },
  {
    "zip": "200 09",
    "city": "ΔΕΡΒΕΝΙ"
  },
  {
    "zip": "200 14",
    "city": "ΓΚΟΥΡΑ"
  },
  {
    "zip": "201 31",
    "city": "ΚΟΡΙΝΘΟΣ"
  },
  {
    "zip": "201 32",
    "city": "ΚΟΡΙΝΘΟΣ"
  },
  {
    "zip": "201 50",
    "city": "ΚΟΡΙΝΘΟΣ"
  },
  {
    "zip": "202 00",
    "city": "ΚΙΑΤΟ"
  },
  {
    "zip": "203 00",
    "city": "ΛΟΥΤΡΑΚΙ"
  },
  {
    "zip": "204 00",
    "city": "ΞΥΛΟΚΑΣΤΡΟ"
  },
  {
    "zip": "205 00",
    "city": "ΝΕΜΕΑ"
  },
  {
    "zip": "210 51",
    "city": "ΕΡΜΙΟΝΗ"
  },
  {
    "zip": "210 52",
    "city": "ΛΥΓΟΥΡΙΟ"
  },
  {
    "zip": "210 55",
    "city": "ΑΓΙΑ ΤΡΙΑΔΑ"
  },
  {
    "zip": "210 56",
    "city": "ΤΟΛΟ"
  },
  {
    "zip": "210 59",
    "city": "ΠΑΛΑΙΑ ΕΠΙΔΑΥΡΟΣ"
  },
  {
    "zip": "211 00",
    "city": "ΝΑΥΠΛΙΟ"
  },
  {
    "zip": "212 31",
    "city": "ΑΡΓΟΣ"
  },
  {
    "zip": "212 32",
    "city": "ΑΡΓΟΣ"
  },
  {
    "zip": "212 50",
    "city": "ΑΡΓΟΣ"
  },
  {
    "zip": "213 00",
    "city": "ΚΡΑΝΙΔΙ"
  },
  {
    "zip": "220 01",
    "city": "ΑΣΤΡΟΣ"
  },
  {
    "zip": "220 02",
    "city": "ΛΕΒΙΔΙ"
  },
  {
    "zip": "220 07",
    "city": "ΔΗΜΗΤΣΑΝΑ"
  },
  {
    "zip": "220 08",
    "city": "ΤΡΟΠΑΙΑ"
  },
  {
    "zip": "220 10",
    "city": "ΒΥΤΙΝΑ"
  },
  {
    "zip": "220 12",
    "city": "ΣΤΑΔΙΟ"
  },
  {
    "zip": "220 15",
    "city": "ΚΟΝΤΟΒΑΖΑΙΝΑ"
  },
  {
    "zip": "220 27",
    "city": "ΚΑΤΩ ΑΣΕΑ"
  },
  {
    "zip": "220 28",
    "city": "ΠΑΛΟΥΜΠΑ"
  },
  {
    "zip": "220 29",
    "city": "ΤΥΡΟΣΑΠΟΥΝΑΚΑΙΙΚΑ"
  },
  {
    "zip": "221 31",
    "city": "ΤΡΙΠΟΛΗ"
  },
  {
    "zip": "221 32",
    "city": "ΤΡΙΠΟΛΗ"
  },
  {
    "zip": "221 50",
    "city": "ΤΡΙΠΟΛΗ"
  },
  {
    "zip": "222 00",
    "city": "ΜΕΓΑΛΟΠΟΛΗ"
  },
  {
    "zip": "223 00",
    "city": "ΛΕΩΝΙΔΙ"
  },
  {
    "zip": "230 51",
    "city": "ΣΚΑΛΑ"
  },
  {
    "zip": "230 52",
    "city": "ΜΟΛΑΟΙ"
  },
  {
    "zip": "230 53",
    "city": "ΝΕΑΠΟΛΗ ΛΑΚΩΝΙΑΣ"
  },
  {
    "zip": "230 54",
    "city": "ΞΗΡΟΚΑΜΠΙ"
  },
  {
    "zip": "230 59",
    "city": "ΚΑΣΤΟΡΕΙΟ"
  },
  {
    "zip": "230 62",
    "city": "ΑΡΕΟΠΟΛΗ"
  },
  {
    "zip": "230 70",
    "city": "ΜΟΝΕΜΒΑΣΙΑ"
  },
  {
    "zip": "231 00",
    "city": "ΣΠΑΡΤΗ"
  },
  {
    "zip": "231 50",
    "city": "ΣΠΑΡΤΗ"
  },
  {
    "zip": "232 00",
    "city": "ΓΥΘΕΙΟ"
  },
  {
    "zip": "240 01",
    "city": "ΠΥΛΟΣ"
  },
  {
    "zip": "240 02",
    "city": "ΜΕΛΙΓΑΛΑΣ"
  },
  {
    "zip": "240 04",
    "city": "ΚΟΡΩΝΗ"
  },
  {
    "zip": "240 05",
    "city": "ΠΕΤΑΛΙΔΙ"
  },
  {
    "zip": "240 06",
    "city": "ΜΕΘΩΝΗ ΠΥΛΙΑΣ"
  },
  {
    "zip": "240 08",
    "city": "ΔΙΑΒΟΛΙΤΣΙ"
  },
  {
    "zip": "240 09",
    "city": "ΘΟΥΡΙΑ"
  },
  {
    "zip": "240 11",
    "city": "ΔΩΡΙΟ"
  },
  {
    "zip": "240 22",
    "city": "ΚΑΡΔΑΜΥΛΗ"
  },
  {
    "zip": "241 31",
    "city": "ΚΑΛΑΜΑΤΑ"
  },
  {
    "zip": "241 32",
    "city": "ΚΑΛΑΜΑΤΑ"
  },
  {
    "zip": "241 33",
    "city": "ΚΑΛΑΜΑΤΑ"
  },
  {
    "zip": "241 34",
    "city": "ΚΑΛΑΜΑΤΑ"
  },
  {
    "zip": "241 50",
    "city": "ΚΑΛΑΜΑΤΑ"
  },
  {
    "zip": "242 00",
    "city": "ΜΕΣΣΗΝΗ"
  },
  {
    "zip": "243 00",
    "city": "ΦΙΛΙΑΤΡΑ"
  },
  {
    "zip": "244 00",
    "city": "ΓΑΡΓΑΛΙΑΝΟΙ"
  },
  {
    "zip": "245 00",
    "city": "ΚΥΠΑΡΙΣΣΙΑ"
  },
  {
    "zip": "250 01",
    "city": "ΚΑΛΑΒΡΥΤΑ"
  },
  {
    "zip": "250 02",
    "city": "ΒΡΑΧΝΑΙΙΚΑ"
  },
  {
    "zip": "250 03",
    "city": "ΔΙΑΚΟΠΤΟ"
  },
  {
    "zip": "250 04",
    "city": "ΔΑΦΝΗ ΑΧΑΪΑΣ"
  },
  {
    "zip": "250 04",
    "city": "ΔΑΦΝΗ ΚΑΛΑΒΡΥΤΩΝ"
  },
  {
    "zip": "250 06",
    "city": "ΑΚΡΑΤΑ"
  },
  {
    "zip": "250 07",
    "city": "ΚΛΕΙΤΟΡΙΑ"
  },
  {
    "zip": "250 08",
    "city": "ΧΑΛΑΝΔΡΙΤΣΑ"
  },
  {
    "zip": "250 11",
    "city": "ΚΑΛΑΒΡΥΤΑ"
  },
  {
    "zip": "250 15",
    "city": "ΕΡΥΜΑΝΘΕΙΑ"
  },
  {
    "zip": "251 00",
    "city": "ΑΙΓΙΟ"
  },
  {
    "zip": "252 00",
    "city": "ΚΑΤΩ ΑΧΑΪΑ"
  },
  {
    "zip": "262 21",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "262 22",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "262 23",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "262 24",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "262 25",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "262 26",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "263 31",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "263 32",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "263 33",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "263 34",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "263 35",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "263 36",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "264 41",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "264 42",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "264 43",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "265 00",
    "city": "ΠΑΤΡΑ"
  },
  {
    "zip": "270 50",
    "city": "ΒΑΡΘΟΛΟΜΙΟ"
  },
  {
    "zip": "270 51",
    "city": "ΑΝΔΡΑΒΙΔΑ"
  },
  {
    "zip": "270 52",
    "city": "Σ. Σ. ΒΑΡΔΑΣ"
  },
  {
    "zip": "270 53",
    "city": "ΛΕΧΑΙΝΑ"
  },
  {
    "zip": "270 54",
    "city": "ΖΑΧΑΡΩ"
  },
  {
    "zip": "270 55",
    "city": "ΚΡΕΣΤΕΝΑ"
  },
  {
    "zip": "270 56",
    "city": "ΝΕΑ ΦΙΓΑΛΕΙΑ"
  },
  {
    "zip": "270 61",
    "city": "ΑΝΔΡΙΤΣΑΙΝΑ"
  },
  {
    "zip": "270 63",
    "city": "ΛΑΜΠΕΙΑ"
  },
  {
    "zip": "270 64",
    "city": "ΚΑΡΑΤΟΥΛΑΣ"
  },
  {
    "zip": "270 65",
    "city": "ΑΡΧΑΙΑ ΟΛΥΜΠΙΑ"
  },
  {
    "zip": "270 66",
    "city": "ΛΑΛΑΣ"
  },
  {
    "zip": "270 67",
    "city": "ΚΑΤΑΚΟΛΟ"
  },
  {
    "zip": "270 69",
    "city": "ΕΦΥΡΑ"
  },
  {
    "zip": "271 31",
    "city": "ΠΥΡΓΟΣ"
  },
  {
    "zip": "271 50",
    "city": "ΠΥΡΓΟΣ ΗΛΕΙΑΣ"
  },
  {
    "zip": "272 00",
    "city": "ΑΜΑΛΙΑΔΑ"
  },
  {
    "zip": "273 00",
    "city": "ΓΑΣΤΟΥΝΗ"
  },
  {
    "zip": "280 80",
    "city": "ΣΑΜΗ"
  },
  {
    "zip": "280 81",
    "city": "ΑΓΙΑ ΕΥΦΗΜΙΑ"
  },
  {
    "zip": "280 84",
    "city": "ΦΙΣΚΑΡΔΟ"
  },
  {
    "zip": "280 86",
    "city": "ΠΟΡΟΣ ΚΕΦΑΛΛΗΝΙΑΣ"
  },
  {
    "zip": "281 00",
    "city": "ΑΡΓΟΣΤΟΛΙ"
  },
  {
    "zip": "282 00",
    "city": "ΛΗΞΟΥΡΙ"
  },
  {
    "zip": "283 00",
    "city": "ΙΘΑΚΗ"
  },
  {
    "zip": "290 90",
    "city": "ΚΑΤΑΣΤΑΡΙ"
  },
  {
    "zip": "290 92",
    "city": "ΜΑΧΑΙΡΑΔΟ"
  },
  {
    "zip": "291 00",
    "city": "ΖΑΚΥΝΘΟΣ"
  },
  {
    "zip": "300 01",
    "city": "ΝΕΟΧΩΡΙ ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ"
  },
  {
    "zip": "300 02",
    "city": "ΒΟΝΙΤΣΑ"
  },
  {
    "zip": "300 03",
    "city": "ΠΑΝΑΙΤΩΛΙΟ"
  },
  {
    "zip": "300 04",
    "city": "ΚΑΤΟΥΝΑ"
  },
  {
    "zip": "300 05",
    "city": "ΚΑΙΝΟΥΡΓΙΟ"
  },
  {
    "zip": "300 06",
    "city": "ΑΣΤΑΚΟΣ"
  },
  {
    "zip": "300 08",
    "city": "ΘΕΡΜΟ"
  },
  {
    "zip": "300 09",
    "city": "ΦΥΤΕΙΕΣ"
  },
  {
    "zip": "300 10",
    "city": "ΠΑΡΑΒΟΛΑ"
  },
  {
    "zip": "300 11",
    "city": "ΜΑΤΑΡΑΓΚΑ"
  },
  {
    "zip": "300 12",
    "city": "ΠΑΛΑΙΡΟΣ"
  },
  {
    "zip": "300 14",
    "city": "ΕΥΗΝΟΧΩΡΙ"
  },
  {
    "zip": "300 15",
    "city": "ΓΑΒΑΛΟΥ"
  },
  {
    "zip": "300 17",
    "city": "ΕΜΠΕΣΟΣ"
  },
  {
    "zip": "300 19",
    "city": "ΜΥΤΙΚΑΣ"
  },
  {
    "zip": "300 20",
    "city": "ΑΝΤΙΡΡΙΟ"
  },
  {
    "zip": "300 20",
    "city": "ΝΑΥΠΑΚΤΟΣ"
  },
  {
    "zip": "300 21",
    "city": "ΑΓΙΟΣ ΒΛΑΣΙΟΣ"
  },
  {
    "zip": "300 22",
    "city": "ΠΛΑΤΑΝΟΣ ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ"
  },
  {
    "zip": "300 23",
    "city": "ΑΝΩ ΧΩΡΑ"
  },
  {
    "zip": "300 27",
    "city": "ΑΓΙΟΣ ΚΩΝΣΤΑΝΤΙΝΟΣ"
  },
  {
    "zip": "301 31",
    "city": "ΑΓΡΙΝΙΟ"
  },
  {
    "zip": "301 32",
    "city": "ΑΓΡΙΝΙΟ"
  },
  {
    "zip": "301 33",
    "city": "ΑΓΡΙΝΙΟ"
  },
  {
    "zip": "301 50",
    "city": "ΑΓΡΙΝΙΟ"
  },
  {
    "zip": "302 00",
    "city": "ΜΕΣΟΛΟΓΓΙ"
  },
  {
    "zip": "303 00",
    "city": "ΝΑΥΠΑΚΤΟΣ"
  },
  {
    "zip": "304 00",
    "city": "ΑΙΤΩΛΙΚΟ"
  },
  {
    "zip": "305 00",
    "city": "ΑΜΦΙΛΟΧΙΑ"
  },
  {
    "zip": "310 82",
    "city": "ΒΑΣΙΛΙΚΗ"
  },
  {
    "zip": "310 84",
    "city": "ΝΥΔΡΙ"
  },
  {
    "zip": "311 00",
    "city": "ΛΕΥΚΑΔΑ"
  },
  {
    "zip": "320 01",
    "city": "ΑΛΙΑΡΤΟΣ"
  },
  {
    "zip": "320 02",
    "city": "ΒΑΓΙΑ"
  },
  {
    "zip": "320 03",
    "city": "ΠΑΡΑΛΙΑ ΔΙΣΤΟΜΟΥ"
  },
  {
    "zip": "320 04",
    "city": "ΑΡΑΧΟΒΑ"
  },
  {
    "zip": "320 05",
    "city": "ΔΙΣΤΟΜΟ"
  },
  {
    "zip": "320 06",
    "city": "ΚΥΡΙΑΚΙ"
  },
  {
    "zip": "320 09",
    "city": "ΣΧΗΜΑΤΑΡΙ"
  },
  {
    "zip": "321 31",
    "city": "ΛΕΒΑΔΕΙΑ"
  },
  {
    "zip": "321 50",
    "city": "ΛΕΒΑΔΕΙΑ"
  },
  {
    "zip": "322 00",
    "city": "ΘΗΒΑ"
  },
  {
    "zip": "323 00",
    "city": "ΟΡΧΟΜΕΝΟΣ"
  },
  {
    "zip": "330 52",
    "city": "ΓΑΛΑΞΙΔΙ"
  },
  {
    "zip": "330 53",
    "city": "ΛΙΔΟΡΙΚΙ"
  },
  {
    "zip": "330 54",
    "city": "ΔΕΛΦΟΙ"
  },
  {
    "zip": "330 56",
    "city": "ΕΥΠΑΛΙΟ"
  },
  {
    "zip": "330 57",
    "city": "ΓΡΑΒΙΑ"
  },
  {
    "zip": "330 58",
    "city": "ΕΡΑΤΕΙΝΗ"
  },
  {
    "zip": "331 00",
    "city": "ΑΜΦΙΣΣΑ"
  },
  {
    "zip": "332 00",
    "city": "ΙΤΕΑ ΦΩΚΙΔΑΣ"
  },
  {
    "zip": "340 01",
    "city": "ΚΑΡΥΣΤΟΣ"
  },
  {
    "zip": "340 02",
    "city": "ΒΑΣΙΛΙΚΟ"
  },
  {
    "zip": "340 03",
    "city": "ΚΥΜΗ"
  },
  {
    "zip": "340 04",
    "city": "ΜΑΝΤΟΥΔΙ"
  },
  {
    "zip": "340 05",
    "city": "ΛΙΜΝΗ"
  },
  {
    "zip": "340 06",
    "city": "ΑΜΑΡΥΝΘΟΣ"
  },
  {
    "zip": "340 07",
    "city": "ΣΚΥΡΟΣ"
  },
  {
    "zip": "340 08",
    "city": "ΕΡΕΤΡΙΑ"
  },
  {
    "zip": "340 09",
    "city": "ΑΥΛΩΝΑΡΙ"
  },
  {
    "zip": "340 13",
    "city": "ΜΑΡΜΑΡΙ"
  },
  {
    "zip": "340 15",
    "city": "ΝΕΑ ΣΤΥΡΑ"
  },
  {
    "zip": "341 31",
    "city": "ΧΑΛΚΙΔΑ"
  },
  {
    "zip": "341 32",
    "city": "ΧΑΛΚΙΔΑ"
  },
  {
    "zip": "341 33",
    "city": "ΧΑΛΚΙΔΑ"
  },
  {
    "zip": "341 50",
    "city": "ΧΑΛΚΙΔΑ"
  },
  {
    "zip": "342 00",
    "city": "ΙΣΤΙΑΙΑ"
  },
  {
    "zip": "343 00",
    "city": "ΛΟΥΤΡΑ ΑΙΔΗΨΟΥ"
  },
  {
    "zip": "344 00",
    "city": "ΨΑΧΝΑ"
  },
  {
    "zip": "345 00",
    "city": "ΑΛΙΒΕΡΙ"
  },
  {
    "zip": "346 00",
    "city": "ΝΕΑ ΑΡΤΑΚΗ"
  },
  {
    "zip": "350 01",
    "city": "ΜΑΛΕΣΙΝΑ"
  },
  {
    "zip": "350 02",
    "city": "ΑΜΦΙΚΛΕΙΑ"
  },
  {
    "zip": "350 03",
    "city": "ΣΠΕΡΧΕΙΑΔΑ"
  },
  {
    "zip": "350 04",
    "city": "ΚΑΤΩ ΤΙΘΟΡΕΑ"
  },
  {
    "zip": "350 05",
    "city": "ΜΑΡΤΙΝΟ"
  },
  {
    "zip": "350 06",
    "city": "ΑΓΙΟΣ ΚΩΝΣΤΑΝΤΙΝΟΣ ΦΘΙΩΤΙΔΑΣ"
  },
  {
    "zip": "350 08",
    "city": "ΚΑΜΕΝΑ ΒΟΥΡΛΑ"
  },
  {
    "zip": "350 09",
    "city": "ΜΩΛΟΣ"
  },
  {
    "zip": "350 10",
    "city": "ΔΟΜΟΚΟΣ"
  },
  {
    "zip": "350 11",
    "city": "ΜΑΚΡΑΚΩΜΗ"
  },
  {
    "zip": "350 15",
    "city": "ΚΑΤΩ ΤΙΘΟΡΕΑ"
  },
  {
    "zip": "351 31",
    "city": "ΛΑΜΙΑ"
  },
  {
    "zip": "351 32",
    "city": "ΛΑΜΙΑ"
  },
  {
    "zip": "351 33",
    "city": "ΛΑΜΙΑ"
  },
  {
    "zip": "351 50",
    "city": "ΛΑΜΙΑ"
  },
  {
    "zip": "352 00",
    "city": "ΑΤΑΛΑΝΤΗ"
  },
  {
    "zip": "353 00",
    "city": "ΣΤΥΛΙΔΑ"
  },
  {
    "zip": "360 71",
    "city": "ΚΕΡΑΣΟΧΩΡΙ"
  },
  {
    "zip": "360 72",
    "city": "ΓΡΑΝΙΤΣΑ"
  },
  {
    "zip": "360 80",
    "city": "ΦΟΥΡΝΑ"
  },
  {
    "zip": "361 00",
    "city": "ΚΑΡΠΕΝΗΣΙ"
  },
  {
    "zip": "370 01",
    "city": "ΖΑΓΟΡΑ"
  },
  {
    "zip": "370 02",
    "city": "ΣΚΙΑΘΟΣ"
  },
  {
    "zip": "370 03",
    "city": "ΣΚΟΠΕΛΟΣ"
  },
  {
    "zip": "370 05",
    "city": "ΑΛΟΝΝΗΣΟΣ"
  },
  {
    "zip": "370 06",
    "city": "ΑΡΓΑΛΑΣΤΗ"
  },
  {
    "zip": "370 08",
    "city": "ΣΟΥΡΠΗ"
  },
  {
    "zip": "371 00",
    "city": "ΑΛΜΥΡΟΣ"
  },
  {
    "zip": "373 00",
    "city": "ΑΓΡΙΑ"
  },
  {
    "zip": "374 00",
    "city": "ΝΕΑ ΑΓΧΙΑΛΟΣ"
  },
  {
    "zip": "375 00",
    "city": "ΒΕΛΕΣΤΙΝΟ"
  },
  {
    "zip": "382 21",
    "city": "ΒΟΛΟΣ"
  },
  {
    "zip": "382 22",
    "city": "ΒΟΛΟΣ"
  },
  {
    "zip": "382 23",
    "city": "ΒΟΛΟΣ"
  },
  {
    "zip": "383 33",
    "city": "ΒΟΛΟΣ"
  },
  {
    "zip": "383 34",
    "city": "ΒΟΛΟΣ"
  },
  {
    "zip": "384 45",
    "city": "ΝΕΑ ΙΩΝΙΑ ΒΟΛΟΥ"
  },
  {
    "zip": "384 46",
    "city": "ΝΕΑ ΙΩΝΙΑ ΒΟΛΟΥ"
  },
  {
    "zip": "385 00",
    "city": "ΒΟΛΟΣ"
  },
  {
    "zip": "400 03",
    "city": "ΑΓΙΑ"
  },
  {
    "zip": "400 06",
    "city": "ΣΥΚΟΥΡΙΟΝ"
  },
  {
    "zip": "401 00",
    "city": "ΤΥΡΝΑΒΟΣ"
  },
  {
    "zip": "402 00",
    "city": "ΕΛΑΣΣΟΝΑ"
  },
  {
    "zip": "403 00",
    "city": "ΦΑΡΣΑΛΑ"
  },
  {
    "zip": "404 00",
    "city": "ΑΜΠΕΛΩΝΑΣ"
  },
  {
    "zip": "410 05",
    "city": "ΝΙΚΑΙΑ ΛΑΡΙΣΑΣ"
  },
  {
    "zip": "412 21",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "412 22",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "412 23",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "413 34",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "413 35",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "413 36",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "414 35",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "414 47",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "414 48",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "415 00",
    "city": "ΛΑΡΙΣΑ"
  },
  {
    "zip": "420 31",
    "city": "ΦΑΡΚΑΔΟΝΑ"
  },
  {
    "zip": "420 32",
    "city": "ΠΥΛΗ"
  },
  {
    "zip": "421 31",
    "city": "ΤΡΙΚΑΛΑ"
  },
  {
    "zip": "421 32",
    "city": "ΤΡΙΚΑΛΑ"
  },
  {
    "zip": "421 50",
    "city": "ΤΡΙΚΑΛΑ"
  },
  {
    "zip": "422 00",
    "city": "ΚΑΛΑΜΠΑΚΑ"
  },
  {
    "zip": "430 60",
    "city": "ΜΟΥΖΑΚΙ"
  },
  {
    "zip": "430 61",
    "city": "ΑΓΝΑΝΤΕΡΟ"
  },
  {
    "zip": "430 63",
    "city": "ΛΕΟΝΤΑΡΙ"
  },
  {
    "zip": "431 31",
    "city": "ΚΑΡΔΙΤΣΑ"
  },
  {
    "zip": "431 32",
    "city": "ΚΑΡΔΙΤΣΑ"
  },
  {
    "zip": "431 50",
    "city": "ΚΑΡΔΙΤΣΑ"
  },
  {
    "zip": "432 00",
    "city": "ΠΑΛΑΜΑΣ"
  },
  {
    "zip": "433 00",
    "city": "ΣΟΦΑΔΕΣ"
  },
  {
    "zip": "440 01",
    "city": "ΠΡΑΜΑΝΤΑ"
  },
  {
    "zip": "440 02",
    "city": "ΔΕΛΒΙΝΑΚΙ"
  },
  {
    "zip": "440 03",
    "city": "ΖΙΤΣΑ"
  },
  {
    "zip": "440 04",
    "city": "ΔΟΛΙΑΝΑ"
  },
  {
    "zip": "440 10",
    "city": "ΤΣΕΠΕΛΟΒΟ"
  },
  {
    "zip": "440 13",
    "city": "ΚΑΛΕΝΤΖΙ"
  },
  {
    "zip": "440 14",
    "city": "ΓΡΕΒΕΝΙΤΙΟ"
  },
  {
    "zip": "441 00",
    "city": "ΚΟΝΙΤΣΑ"
  },
  {
    "zip": "442 00",
    "city": "ΜΕΤΣΟΒΟ"
  },
  {
    "zip": "452 21",
    "city": "ΑΝΑΤΟΛΗ"
  },
  {
    "zip": "452 21",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "452 22",
    "city": "ΑΝΑΤΟΛΗ"
  },
  {
    "zip": "452 22",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "453 32",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "453 33",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "454 44",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "454 45",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "455 00",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "455 50",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "455 60",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "455 70",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "455 80",
    "city": "ΙΩΑΝΝΙΝΑ"
  },
  {
    "zip": "460 30",
    "city": "ΜΑΡΓΑΡΙΤΙ"
  },
  {
    "zip": "461 00",
    "city": "ΗΓΟΥΜΕΝΙΤΣΑ"
  },
  {
    "zip": "462 00",
    "city": "ΠΑΡΑΜΥΘΙΑ"
  },
  {
    "zip": "463 00",
    "city": "ΦΙΛΙΑΤΕΣ"
  },
  {
    "zip": "470 40",
    "city": "ΚΟΜΠΟΤΙ"
  },
  {
    "zip": "470 41",
    "city": "ΝΕΟΧΩΡΙ ΑΡΤΑΣ"
  },
  {
    "zip": "470 43",
    "city": "ΑΓΝΑΝΤΑ"
  },
  {
    "zip": "470 44",
    "city": "ΑΝΩ ΚΑΛΕΝΤΙΝΗ"
  },
  {
    "zip": "470 45",
    "city": "ΒΟΥΡΓΑΡΕΛΙ"
  },
  {
    "zip": "470 47",
    "city": "ΜΗΛΙΑΝΑ"
  },
  {
    "zip": "471 31",
    "city": "ΑΡΤΑ"
  },
  {
    "zip": "471 32",
    "city": "ΑΡΤΑ"
  },
  {
    "zip": "471 50",
    "city": "ΑΡΤΑ"
  },
  {
    "zip": "480 60",
    "city": "ΠΑΡΓΑ"
  },
  {
    "zip": "480 61",
    "city": "ΛΟΥΡΟΣ"
  },
  {
    "zip": "480 62",
    "city": "ΚΑΝΑΛΑΚΙ"
  },
  {
    "zip": "481 00",
    "city": "ΠΡΕΒΕΖΑ"
  },
  {
    "zip": "482 00",
    "city": "ΦΙΛΙΠΠΙΑΔΑ"
  },
  {
    "zip": "483 00",
    "city": "ΘΕΣΠΡΩΤΙΚΟ"
  },
  {
    "zip": "490 80",
    "city": "ΛΕΥΚΙΜΜΗ"
  },
  {
    "zip": "490 81",
    "city": "ΚΑΡΟΥΣΑΔΕΣ"
  },
  {
    "zip": "490 82",
    "city": "ΓΑΪΟΣ"
  },
  {
    "zip": "490 83",
    "city": "ΤΖΑΒΡΟΣ"
  },
  {
    "zip": "490 84",
    "city": "ΑΧΙΛΛΕΙΟ"
  },
  {
    "zip": "491 00",
    "city": "ΚΕΡΚΥΡΑ"
  },
  {
    "zip": "491 31",
    "city": "ΚΕΡΚΥΡΑ"
  },
  {
    "zip": "491 32",
    "city": "ΚΕΡΚΥΡΑ"
  },
  {
    "zip": "491 50",
    "city": "ΚΕΡΚΥΡΑ"
  },
  {
    "zip": "500 01",
    "city": "ΝΕΑΠΟΛΗ ΚΟΖΑΝΗΣ"
  },
  {
    "zip": "500 02",
    "city": "ΤΣΟΤΥΛΙ"
  },
  {
    "zip": "500 03",
    "city": "ΕΡΑΤΥΡΑ"
  },
  {
    "zip": "500 04",
    "city": "ΑΙΑΝΗ"
  },
  {
    "zip": "500 05",
    "city": "ΕΜΠΟΡΙΟ ΚΟΖΑΝΗΣ"
  },
  {
    "zip": "500 07",
    "city": "ΠΕΝΤΑΛΟΦΟΣ"
  },
  {
    "zip": "500 10",
    "city": "ΚΡΟΚΟΣ"
  },
  {
    "zip": "501 31",
    "city": "ΚΟΖΑΝΗ"
  },
  {
    "zip": "501 32",
    "city": "ΚΟΖΑΝΗ"
  },
  {
    "zip": "501 50",
    "city": "ΚΟΖΑΝΗ"
  },
  {
    "zip": "502 00",
    "city": "ΠΤΟΛΕΜΑΪΔΑ"
  },
  {
    "zip": "503 00",
    "city": "ΣΙΑΤΙΣΤΑ"
  },
  {
    "zip": "504 00",
    "city": "ΒΕΛΒΕΝΤΟΣ"
  },
  {
    "zip": "505 00",
    "city": "ΣΕΡΒΙΑ"
  },
  {
    "zip": "510 30",
    "city": "ΑΓΙΟΣ ΓΕΩΡΓΙΟΣ"
  },
  {
    "zip": "511 00",
    "city": "ΓΡΕΒΕΝΑ"
  },
  {
    "zip": "512 00",
    "city": "ΔΕΣΚΑΤΗ"
  },
  {
    "zip": "520 50",
    "city": "ΜΕΣΟΠΟΤΑΜΙΑ"
  },
  {
    "zip": "520 51",
    "city": "ΝΕΣΤΟΡΙΟ"
  },
  {
    "zip": "520 52",
    "city": "ΚΟΡΗΣΟΣ"
  },
  {
    "zip": "520 55",
    "city": "ΜΑΚΡΟΧΩΡΙ ΚΑΣΤΟΡΙΑΣ"
  },
  {
    "zip": "520 56",
    "city": "ΜΑΥΡΟΧΩΡΙ"
  },
  {
    "zip": "520 57",
    "city": "ΔΙΣΠΗΛΙΟ"
  },
  {
    "zip": "521 00",
    "city": "ΚΑΣΤΟΡΙΑ"
  },
  {
    "zip": "522 00",
    "city": "ΑΡΓΟΣ ΟΡΕΣΤΙΚΟ"
  },
  {
    "zip": "530 70",
    "city": "ΦΙΛΩΤΑΣ"
  },
  {
    "zip": "530 71",
    "city": "ΜΕΛΙΤΗ"
  },
  {
    "zip": "530 73",
    "city": "ΛΕΧΟΒΟ"
  },
  {
    "zip": "530 77",
    "city": "ΑΓΙΟΣ ΓΕΡΜΑΝΟΣ"
  },
  {
    "zip": "531 00",
    "city": "ΦΛΩΡΙΝΑ"
  },
  {
    "zip": "532 00",
    "city": "ΑΜΥΝΤΑΙΟ"
  },
  {
    "zip": "542 48",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "542 49",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "542 50",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "542 52",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "543 51",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "543 52",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "543 52",
    "city": "ΠΥΛΑΙΑ"
  },
  {
    "zip": "544 53",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "544 54",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "544 54",
    "city": "ΠΥΛΑΙΑ"
  },
  {
    "zip": "545 00",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 21",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 22",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 23",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 24",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 25",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 26",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 27",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 28",
    "city": "ΜΕΝΕΜΕΝΗ"
  },
  {
    "zip": "546 29",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 30",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 31",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 32",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 33",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 34",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 35",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 36",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 38",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 39",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 40",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 41",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 42",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 43",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 44",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 45",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 46",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "546 55",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "551 31",
    "city": "ΚΑΛΑΜΑΡΙΑ"
  },
  {
    "zip": "551 32",
    "city": "ΚΑΛΑΜΑΡΙΑ"
  },
  {
    "zip": "551 33",
    "city": "ΚΑΛΑΜΑΡΙΑ"
  },
  {
    "zip": "551 34",
    "city": "ΚΑΛΑΜΑΡΙΑ"
  },
  {
    "zip": "551 35",
    "city": "ΚΑΛΑΜΑΡΙΑ"
  },
  {
    "zip": "552 36",
    "city": "ΠΑΝΟΡΑΜΑ"
  },
  {
    "zip": "553 37",
    "city": "ΤΡΙΑΝΔΡΙΑ"
  },
  {
    "zip": "554 37",
    "city": "ΑΓΙΟΣ ΠΑΥΛΟΣ"
  },
  {
    "zip": "554 38",
    "city": "ΑΓΙΟΣ ΠΑΥΛΟΣ"
  },
  {
    "zip": "555 34",
    "city": "ΠΥΛΑΙΑ"
  },
  {
    "zip": "555 35",
    "city": "ΠΥΛΑΙΑ"
  },
  {
    "zip": "555 36",
    "city": "ΠΥΛΑΙΑ"
  },
  {
    "zip": "561 21",
    "city": "ΑΜΠΕΛΟΚΗΠΟΙ"
  },
  {
    "zip": "561 22",
    "city": "ΑΜΠΕΛΟΚΗΠΟΙ"
  },
  {
    "zip": "561 22",
    "city": "ΜΕΝΕΜΕΝΗ"
  },
  {
    "zip": "561 23",
    "city": "ΑΜΠΕΛΟΚΗΠΟΙ"
  },
  {
    "zip": "562 24",
    "city": "ΕΥΟΣΜΟΣ"
  },
  {
    "zip": "562 25",
    "city": "ΕΥΟΣΜΟΣ"
  },
  {
    "zip": "562 26",
    "city": "ΕΥΟΣΜΟΣ"
  },
  {
    "zip": "562 38",
    "city": "ΕΥΟΣΜΟΣ"
  },
  {
    "zip": "563 33",
    "city": "ΠΟΛΙΧΝΗ"
  },
  {
    "zip": "563 34",
    "city": "ΕΛΕΥΘΕΡΙΟ-ΚΟΡΔΕΛΙΟ"
  },
  {
    "zip": "563 35",
    "city": "ΠΟΛΙΧΝΗ"
  },
  {
    "zip": "564 04",
    "city": "ΚΑΒΑΛΑ"
  },
  {
    "zip": "564 29",
    "city": "ΕΥΚΑΡΠΙΑ"
  },
  {
    "zip": "564 29",
    "city": "ΘΕΣΣΑΛΟΝΙΚΗ"
  },
  {
    "zip": "564 30",
    "city": "ΣΤΑΥΡΟΥΠΟΛΗ"
  },
  {
    "zip": "564 31",
    "city": "ΣΤΑΥΡΟΥΠΟΛΗ"
  },
  {
    "zip": "564 36",
    "city": "ΣΤΑΥΡΟΥΠΟΛΗ"
  },
  {
    "zip": "564 37",
    "city": "ΣΤΑΥΡΟΥΠΟΛΗ"
  },
  {
    "zip": "564 50",
    "city": "ΕΥΚΑΡΠΙΑ"
  },
  {
    "zip": "565 32",
    "city": "ΠΟΛΙΧΝΗ"
  },
  {
    "zip": "565 33",
    "city": "ΠΟΛΙΧΝΗ"
  },
  {
    "zip": "565 35",
    "city": "ΠΟΛΙΧΝΗ"
  },
  {
    "zip": "565 50",
    "city": "ΠΟΛΙΧΝΗ"
  },
  {
    "zip": "566 25",
    "city": "ΣΥΚΙΕΣ"
  },
  {
    "zip": "566 26",
    "city": "ΣΥΚΙΕΣ"
  },
  {
    "zip": "567 27",
    "city": "ΝΕΑΠΟΛΗ"
  },
  {
    "zip": "567 28",
    "city": "ΝΕΑΠΟΛΗ"
  },
  {
    "zip": "570 00",
    "city": "ΘΕΡΜΗ"
  },
  {
    "zip": "570 01",
    "city": "ΘΕΡΜΗ"
  },
  {
    "zip": "570 02",
    "city": "ΣΟΧΟΣ"
  },
  {
    "zip": "570 03",
    "city": "ΑΓΙΟΣ ΑΘΑΝΑΣΙΟΣ"
  },
  {
    "zip": "570 04",
    "city": "ΝΕΑ ΜΗΧΑΝΙΩΝΑ"
  },
  {
    "zip": "570 06",
    "city": "ΒΑΣΙΛΙΚΑ"
  },
  {
    "zip": "570 07",
    "city": "ΧΑΛΚΗΔΟΝΑ"
  },
  {
    "zip": "570 08",
    "city": "ΙΩΝΙΑ ΘΕΣΣΑΛΟΝΙΚΗΣ"
  },
  {
    "zip": "570 09",
    "city": "ΚΑΛΟΧΩΡΙ"
  },
  {
    "zip": "570 10",
    "city": "ΑΣΒΕΣΤΟΧΩΡΙ"
  },
  {
    "zip": "570 11",
    "city": "ΓΕΦΥΡΑ ΘΕΣΣΑΛΟΝΙΚΗΣ"
  },
  {
    "zip": "570 12",
    "city": "ΖΑΓΚΛΙΒΕΡΙ"
  },
  {
    "zip": "570 13",
    "city": "ΩΡΑΙΟΚΑΣΤΡΟ"
  },
  {
    "zip": "570 14",
    "city": "ΣΤΑΥΡΟΣ ΘΕΣΣΑΛΟΝΙΚΗΣ"
  },
  {
    "zip": "570 19",
    "city": "ΘΕΡΜΑΪΚΟΣ"
  },
  {
    "zip": "570 21",
    "city": "ΑΣΠΡΟΒΑΛΤΑ"
  },
  {
    "zip": "571 00",
    "city": "ΚΟΥΦΑΛΙΑ"
  },
  {
    "zip": "572 00",
    "city": "ΛΑΓΚΑΔΑΣ"
  },
  {
    "zip": "573 00",
    "city": "ΧΑΛΑΣΤΡΑ"
  },
  {
    "zip": "574 00",
    "city": "ΣΙΝΔΟΣ"
  },
  {
    "zip": "575 00",
    "city": "ΕΠΑΝΟΜΗ"
  },
  {
    "zip": "580 02",
    "city": "ΑΡΝΙΣΣΑ"
  },
  {
    "zip": "580 05",
    "city": "ΠΕΛΛΑ"
  },
  {
    "zip": "581 00",
    "city": "ΓΙΑΝΝΙΤΣΑ"
  },
  {
    "zip": "582 00",
    "city": "ΕΔΕΣΣΑ"
  },
  {
    "zip": "583 00",
    "city": "ΚΡΥΑ ΒΡΥΣΗ"
  },
  {
    "zip": "584 00",
    "city": "ΑΡΙΔΑΙΑ"
  },
  {
    "zip": "585 00",
    "city": "ΣΚΥΔΡΑ"
  },
  {
    "zip": "590 31",
    "city": "ΜΕΛΙΚΗ"
  },
  {
    "zip": "590 35",
    "city": "ΚΟΠΑΝΟΣ"
  },
  {
    "zip": "591 00",
    "city": "ΒΕΡΟΙΑ"
  },
  {
    "zip": "591 31",
    "city": "ΒΕΡΟΙΑ"
  },
  {
    "zip": "591 32",
    "city": "ΒΕΡΟΙΑ"
  },
  {
    "zip": "591 50",
    "city": "ΒΕΡΟΙΑ"
  },
  {
    "zip": "592 00",
    "city": "ΝΑΟΥΣΑ"
  },
  {
    "zip": "593 00",
    "city": "ΑΛΕΞΑΝΔΡΕΙΑ"
  },
  {
    "zip": "600 63",
    "city": "ΛΕΠΤΟΚΑΡΥΑ"
  },
  {
    "zip": "600 65",
    "city": "ΠΛΑΤΑΜΩΝΑΣ"
  },
  {
    "zip": "601 31",
    "city": "ΚΑΤΕΡΙΝΗ"
  },
  {
    "zip": "601 32",
    "city": "ΚΑΤΕΡΙΝΗ"
  },
  {
    "zip": "601 33",
    "city": "ΚΑΤΕΡΙΝΗ"
  },
  {
    "zip": "601 34",
    "city": "ΚΑΤΕΡΙΝΗ"
  },
  {
    "zip": "601 50",
    "city": "ΚΑΤΕΡΙΝΗ"
  },
  {
    "zip": "602 00",
    "city": "ΛΙΤΟΧΩΡΟ"
  },
  {
    "zip": "603 00",
    "city": "ΑΙΓΙΝΙΟ"
  },
  {
    "zip": "610 07",
    "city": "ΕΥΡΩΠΟΣ"
  },
  {
    "zip": "611 00",
    "city": "ΚΙΛΚΙΣ"
  },
  {
    "zip": "612 00",
    "city": "ΠΟΛΥΚΑΣΤΡΟ"
  },
  {
    "zip": "613 00",
    "city": "ΓΟΥΜΕΝΙΣΣΑ"
  },
  {
    "zip": "62 124",
    "city": "ΣΕΡΡΕΣ"
  },
  {
    "zip": "620 41",
    "city": "ΡΟΔΟΛΙΒΟΣ"
  },
  {
    "zip": "620 42",
    "city": "ΝΕΑ ΖΙΧΝΗ"
  },
  {
    "zip": "620 47",
    "city": "ΠΡΩΤΗ"
  },
  {
    "zip": "620 49",
    "city": "ΝΙΓΡΙΤΑ"
  },
  {
    "zip": "620 55",
    "city": "ΚΑΤΩ ΠΟΡΟΪΑ"
  },
  {
    "zip": "621 21",
    "city": "ΣΕΡΡΕΣ"
  },
  {
    "zip": "621 22",
    "city": "ΣΕΡΡΕΣ"
  },
  {
    "zip": "621 23",
    "city": "ΣΕΡΡΕΣ"
  },
  {
    "zip": "621 24",
    "city": "ΣΕΡΡΕΣ"
  },
  {
    "zip": "621 25",
    "city": "ΣΕΡΡΕΣ"
  },
  {
    "zip": "622 00",
    "city": "ΝΙΓΡΙΤΑ"
  },
  {
    "zip": "622 22",
    "city": "ΣΕΡΡΕΣ"
  },
  {
    "zip": "623 00",
    "city": "ΣΙΔΗΡΟΚΑΣΤΡΟ"
  },
  {
    "zip": "624 00",
    "city": "ΗΡΑΚΛΕΙΑ"
  },
  {
    "zip": "625 00",
    "city": "ΣΕΡΡΕΣ"
  },
  {
    "zip": "630 72",
    "city": "ΣΥΚΕΑ"
  },
  {
    "zip": "630 73",
    "city": "ΓΑΛΑΤΙΣΤΑ"
  },
  {
    "zip": "630 74",
    "city": "ΑΡΝΑΙΑ"
  },
  {
    "zip": "630 75",
    "city": "ΙΕΡΙΣΣΟΣ"
  },
  {
    "zip": "630 77",
    "city": "ΚΑΣΣΑΝΔΡΕΙΑ"
  },
  {
    "zip": "630 78",
    "city": "ΑΓΙΟΣ ΝΙΚΟΛΑΟΣ ΧΑΛΚΙΔΙΚΗΣ"
  },
  {
    "zip": "630 80",
    "city": "ΝΕΑ ΚΑΛΛΙΚΡΑΤΕΙΑ"
  },
  {
    "zip": "630 81",
    "city": "ΝΕΟΣ ΜΑΡΜΑΡΑΣ"
  },
  {
    "zip": "630 85",
    "city": "ΠΕΥΚΟΧΩΡΙ"
  },
  {
    "zip": "630 86",
    "city": "ΚΑΡΥΕΣ ΑΓΙΟΥ ΟΡΟΥΣ"
  },
  {
    "zip": "630 87",
    "city": "ΔΑΦΝΗ ΑΓΙΟΥ ΟΡΟΥΣ"
  },
  {
    "zip": "630 88",
    "city": "ΝΙΚΗΤΗ"
  },
  {
    "zip": "631 00",
    "city": "ΠΟΛΥΓΥΡΟΣ"
  },
  {
    "zip": "632 00",
    "city": "ΝΕΑ ΜΟΥΔΑΝΙΑ"
  },
  {
    "zip": "640 01",
    "city": "ΝΙΚΗΣΙΑΝΗ"
  },
  {
    "zip": "640 02",
    "city": "ΛΙΜΕΝΑΡΙΑ"
  },
  {
    "zip": "640 03",
    "city": "ΚΡΗΝΙΔΕΣ"
  },
  {
    "zip": "640 04",
    "city": "ΘΑΣΟΣ"
  },
  {
    "zip": "640 06",
    "city": "ΝΕΑ ΚΑΡΒΑΛΗ"
  },
  {
    "zip": "640 07",
    "city": "ΝΕΑ ΠΕΡΑΜΟΣ ΚΑΒΑΛΑΣ"
  },
  {
    "zip": "640 08",
    "city": "ΜΟΥΣΘΕΝΗ"
  },
  {
    "zip": "640 09",
    "city": "ΚΕΧΡΟΚΑΜΠΟΣ"
  },
  {
    "zip": "640 10",
    "city": "ΠΡΙΝΟΣ"
  },
  {
    "zip": "641 00",
    "city": "ΕΛΕΥΘΕΡΟΥΠΟΛΗ"
  },
  {
    "zip": "642 00",
    "city": "ΧΡΥΣΟΥΠΟΛΗ"
  },
  {
    "zip": "652 01",
    "city": "ΚΑΒΑΛΑ"
  },
  {
    "zip": "653 02",
    "city": "ΚΑΒΑΛΑ"
  },
  {
    "zip": "653 03",
    "city": "ΚΑΒΑΛΑ"
  },
  {
    "zip": "654 03",
    "city": "ΚΑΒΑΛΑ"
  },
  {
    "zip": "654 04",
    "city": "ΚΑΒΑΛΑ"
  },
  {
    "zip": "655 00",
    "city": "ΚΑΒΑΛΑ"
  },
  {
    "zip": "660 31",
    "city": "ΚΑΛΑΜΠΑΚΙ"
  },
  {
    "zip": "660 33",
    "city": "ΚΑΤΩ ΝΕΥΡΟΚΟΠΙ"
  },
  {
    "zip": "660 35",
    "city": "ΠΑΡΑΝΕΣΤΙ"
  },
  {
    "zip": "661 31",
    "city": "ΔΡΑΜΑ"
  },
  {
    "zip": "661 32",
    "city": "ΔΡΑΜΑ"
  },
  {
    "zip": "661 33",
    "city": "ΔΡΑΜΑ"
  },
  {
    "zip": "661 50",
    "city": "ΔΡΑΜΑ"
  },
  {
    "zip": "662 00",
    "city": "ΠΡΟΣΟΤΣΑΝΗ"
  },
  {
    "zip": "663 00",
    "city": "ΔΟΞΑΤΟ"
  },
  {
    "zip": "670 62",
    "city": "ΣΤΑΥΡΟΥΠΟΛΗ ΞΑΝΘΗΣ"
  },
  {
    "zip": "670 64",
    "city": "ΓΕΝΙΣΕΑ"
  },
  {
    "zip": "671 31",
    "city": "ΞΑΝΘΗ"
  },
  {
    "zip": "671 32",
    "city": "ΞΑΝΘΗ"
  },
  {
    "zip": "671 33",
    "city": "ΞΑΝΘΗ"
  },
  {
    "zip": "671 50",
    "city": "ΞΑΝΘΗ"
  },
  {
    "zip": "672 00",
    "city": "ΕΥΛΑΛΟ"
  },
  {
    "zip": "673 00",
    "city": "ΕΧΙΝΟΣ"
  },
  {
    "zip": "680 02",
    "city": "ΣΑΜΟΘΡΑΚΗ"
  },
  {
    "zip": "680 03",
    "city": "ΤΥΧΕΡΟ"
  },
  {
    "zip": "680 04",
    "city": "ΛΑΒΑΡΑ"
  },
  {
    "zip": "680 06",
    "city": "ΚΥΠΡΙΝΟΣ"
  },
  {
    "zip": "680 07",
    "city": "ΔΙΚΑΙΑ"
  },
  {
    "zip": "680 10",
    "city": "ΜΕΤΑΞΑΔΕΣ"
  },
  {
    "zip": "681 31",
    "city": "ΑΛΕΞΑΝΔΡΟΥΠΟΛΗ"
  },
  {
    "zip": "681 32",
    "city": "ΑΛΕΞΑΝΔΡΟΥΠΟΛΗ"
  },
  {
    "zip": "681 33",
    "city": "ΑΛΕΞΑΝΔΡΟΥΠΟΛΗ"
  },
  {
    "zip": "681 50",
    "city": "ΑΛΕΞΑΝΔΡΟΥΠΟΛΗ"
  },
  {
    "zip": "682 00",
    "city": "ΟΡΕΣΤΙΑΔΑ"
  },
  {
    "zip": "683 00",
    "city": "ΔΙΔΥΜΟΤΕΙΧΟ"
  },
  {
    "zip": "684 00",
    "city": "ΣΟΥΦΛΙ"
  },
  {
    "zip": "685 00",
    "city": "ΦΕΡΕΣ"
  },
  {
    "zip": "691 31",
    "city": "ΚΟΜΟΤΗΝΗ"
  },
  {
    "zip": "691 32",
    "city": "ΚΟΜΟΤΗΝΗ"
  },
  {
    "zip": "691 33",
    "city": "ΚΟΜΟΤΗΝΗ"
  },
  {
    "zip": "691 50",
    "city": "ΚΟΜΟΤΗΝΗ"
  },
  {
    "zip": "692 00",
    "city": "ΙΑΣΜΟΣ"
  },
  {
    "zip": "693 00",
    "city": "ΣΑΠΕΣ"
  },
  {
    "zip": "694 00",
    "city": "ΞΥΛΑΓΑΝΗ"
  },
  {
    "zip": "700 03",
    "city": "ΑΓΙΑ ΒΑΡΒΑΡΑ"
  },
  {
    "zip": "700 04",
    "city": "ΑΝΩ ΒΙΑΝΝΟΣ"
  },
  {
    "zip": "700 05",
    "city": "ΜΟΧΟΣ"
  },
  {
    "zip": "700 06",
    "city": "ΚΑΣΤΕΛΛΙ"
  },
  {
    "zip": "700 07",
    "city": "ΜΑΛΙΑ"
  },
  {
    "zip": "700 08",
    "city": "ΕΠΙΣΚΟΠΗ ΗΡΑΚΛΕΙΟΥ"
  },
  {
    "zip": "700 10",
    "city": "ΠΥΡΓΟΣ ΗΡΑΚΛΕΙΟΥ"
  },
  {
    "zip": "700 12",
    "city": "ΑΓΙΟΙ ΔΕΚΑ"
  },
  {
    "zip": "700 13",
    "city": "ΑΓΙΟΣ ΜΥΡΩΝΑΣ"
  },
  {
    "zip": "700 14",
    "city": "ΛΙΜΕΝΑΣ ΧΕΡΣΟΝΗΣΟΥ"
  },
  {
    "zip": "700 16",
    "city": "ΑΣΗΜΙ"
  },
  {
    "zip": "701 00",
    "city": "ΑΡΧΑΝΕΣ"
  },
  {
    "zip": "702 00",
    "city": "ΤΥΜΠΑΚΙ"
  },
  {
    "zip": "703 00",
    "city": "ΑΡΚΑΛΟΧΩΡΙ"
  },
  {
    "zip": "704 00",
    "city": "ΜΟΙΡΕΣ"
  },
  {
    "zip": "712 01",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "712 02",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "713 01",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "713 03",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "713 04",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "713 05",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "713 06",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "713 07",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "714 08",
    "city": "ΝΕΑ ΑΛΙΚΑΡΝΑΣΣΟΣ"
  },
  {
    "zip": "714 09",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "714 14",
    "city": "ΓΑΖΙ"
  },
  {
    "zip": "715 00",
    "city": "ΗΡΑΚΛΕΙΟ ΚΡΗΤΗΣ"
  },
  {
    "zip": "720 52",
    "city": "ΤΖΕΡΜΙΑΔΟ"
  },
  {
    "zip": "720 53",
    "city": "ΕΛΟΥΝΤΑ"
  },
  {
    "zip": "720 55",
    "city": "ΜΑΚΡΥΓΙΑΛΟΣ"
  },
  {
    "zip": "721 00",
    "city": "ΑΓΙΟΣ ΝΙΚΟΛΑΟΣ ΚΡΗΤΗΣ"
  },
  {
    "zip": "721 50",
    "city": "ΑΓΙΟΣ ΝΙΚΟΛΑΟΣ ΚΡΗΤΗΣ"
  },
  {
    "zip": "722 00",
    "city": "ΙΕΡΑΠΕΤΡΑ"
  },
  {
    "zip": "723 00",
    "city": "ΣΗΤΕΙΑ"
  },
  {
    "zip": "724 00",
    "city": "ΝΕΑΠΟΛΗ ΛΑΣΙΘΙΟΥ"
  },
  {
    "zip": "73 134",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "730 01",
    "city": "ΠΑΛΑΙΟΧΩΡΑ"
  },
  {
    "zip": "730 02",
    "city": "ΒΟΥΚΟΛΙΕΣ"
  },
  {
    "zip": "730 03",
    "city": "ΚΑΛΥΒΕΣ"
  },
  {
    "zip": "730 04",
    "city": "ΚΑΝΔΑΝΟΣ"
  },
  {
    "zip": "730 05",
    "city": "ΑΛΙΚΙΑΝΟΣ"
  },
  {
    "zip": "730 06",
    "city": "ΚΟΛΥΜΒΑΡΙ"
  },
  {
    "zip": "730 07",
    "city": "ΒΡΥΣΕΣ"
  },
  {
    "zip": "730 11",
    "city": "ΧΩΡΑ ΣΦΑΚΙΩΝ"
  },
  {
    "zip": "730 14",
    "city": "ΠΛΑΤΑΝΙΑΣ ΧΑΝΙΩΝ"
  },
  {
    "zip": "731 31",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "731 32",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "731 33",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "731 34",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "731 35",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "731 36",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "732 00",
    "city": "ΣΟΥΔΑ"
  },
  {
    "zip": "732 32",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "732 33",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "733 00",
    "city": "ΜΟΥΡΝΙΕΣ"
  },
  {
    "zip": "734 00",
    "city": "ΚΙΣΣΑΜΟΣ"
  },
  {
    "zip": "735 00",
    "city": "ΧΑΝΙΑ"
  },
  {
    "zip": "740 51",
    "city": "ΑΝΩΓΕΙΑ"
  },
  {
    "zip": "740 52",
    "city": "ΠΕΡΑΜΑ ΡΕΘΥΜΝΗΣ"
  },
  {
    "zip": "740 53",
    "city": "ΣΠΗΛΙ"
  },
  {
    "zip": "740 55",
    "city": "ΕΠΙΣΚΟΠΗ ΡΕΘΥΜΝΗΣ"
  },
  {
    "zip": "740 60",
    "city": "ΜΥΡΘΙΟΣ"
  },
  {
    "zip": "740 61",
    "city": "ΑΜΑΡΙ"
  },
  {
    "zip": "741 31",
    "city": "ΡΕΘΥΜΝΟ"
  },
  {
    "zip": "741 32",
    "city": "ΡΕΘΥΜΝΟ"
  },
  {
    "zip": "741 33",
    "city": "ΡΕΘΥΜΝΟ"
  },
  {
    "zip": "741 50",
    "city": "ΡΕΘΥΜΝΟ"
  },
  {
    "zip": "801 00",
    "city": "ΚΥΘΗΡΑ"
  },
  {
    "zip": "811 01",
    "city": "ΑΓΙΑΣΟΣ"
  },
  {
    "zip": "811 02",
    "city": "ΑΓΙΑ ΠΑΡΑΣΚΕΥΗ ΛΕΣΒΟΥ"
  },
  {
    "zip": "811 03",
    "city": "ΑΝΤΙΣΣΑ"
  },
  {
    "zip": "811 04",
    "city": "ΜΑΝΤΑΜΑΔΟΣ"
  },
  {
    "zip": "811 05",
    "city": "ΕΡΕΣΟΣ"
  },
  {
    "zip": "811 06",
    "city": "ΠΑΠΠΑΔΟΣ"
  },
  {
    "zip": "811 07",
    "city": "ΚΑΛΛΟΝΗ"
  },
  {
    "zip": "811 08",
    "city": "ΜΗΘΥΜΝΑ"
  },
  {
    "zip": "811 09",
    "city": "ΠΕΤΡΑ"
  },
  {
    "zip": "811 31",
    "city": "ΜΥΤΙΛΗΝΗ"
  },
  {
    "zip": "811 32",
    "city": "ΜΥΤΙΛΗΝΗ"
  },
  {
    "zip": "811 50",
    "city": "ΜΥΤΙΛΗΝΗ"
  },
  {
    "zip": "812 00",
    "city": "ΠΛΩΜΑΡΙ"
  },
  {
    "zip": "813 00",
    "city": "ΠΟΛΙΧΝΙΤΟΣ"
  },
  {
    "zip": "814 00",
    "city": "ΜΥΡΙΝΑ"
  },
  {
    "zip": "814 01",
    "city": "ΜΟΥΔΡΟΣ"
  },
  {
    "zip": "815 00",
    "city": "ΑΓΙΟΣ ΕΥΣΤΡΑΤΙΟΣ"
  },
  {
    "zip": "821 01",
    "city": "ΟΙΝΟΥΣΣΕΣ"
  },
  {
    "zip": "821 02",
    "city": "ΚΑΛΑΜΩΤΗ"
  },
  {
    "zip": "821 03",
    "city": "ΒΟΛΙΣΣΟΣ"
  },
  {
    "zip": "821 04",
    "city": "ΨΑΡΑ"
  },
  {
    "zip": "821 31",
    "city": "ΧΙΟΣ"
  },
  {
    "zip": "821 32",
    "city": "ΧΙΟΣ"
  },
  {
    "zip": "821 50",
    "city": "ΧΙΟΣ"
  },
  {
    "zip": "823 00",
    "city": "ΚΑΡΔΑΜΥΛΑ"
  },
  {
    "zip": "831 00",
    "city": "ΣΑΜΟΣ"
  },
  {
    "zip": "831 03",
    "city": "ΠΥΘΑΓΟΡΕΙΟ"
  },
  {
    "zip": "831 03",
    "city": "ΣΑΜΟΣ"
  },
  {
    "zip": "831 04",
    "city": "ΠΥΡΓΟΣ ΣΑΜΟΥ"
  },
  {
    "zip": "832 00",
    "city": "ΚΑΡΛΟΒΑΣΙ"
  },
  {
    "zip": "833 00",
    "city": "ΑΓΙΟΣ ΚΗΡΥΚΟΣ"
  },
  {
    "zip": "833 01",
    "city": "ΡΑΧΕΣ"
  },
  {
    "zip": "833 02",
    "city": "ΕΥΔΗΛΟΣ"
  },
  {
    "zip": "834 00",
    "city": "ΦΟΥΡΝΟΙ"
  },
  {
    "zip": "840 01",
    "city": "ΙΟΣ"
  },
  {
    "zip": "840 02",
    "city": "ΙΟΥΛΙΣ"
  },
  {
    "zip": "840 03",
    "city": "ΣΙΦΝΟΣ"
  },
  {
    "zip": "840 04",
    "city": "ΚΙΜΩΛΟΣ"
  },
  {
    "zip": "840 05",
    "city": "ΣΕΡΙΦΟΣ"
  },
  {
    "zip": "840 06",
    "city": "ΚΥΘΝΟΣ"
  },
  {
    "zip": "840 07",
    "city": "ΑΝΤΙΠΑΡΟΣ"
  },
  {
    "zip": "840 08",
    "city": "ΑΜΟΡΓΟΣ"
  },
  {
    "zip": "840 09",
    "city": "ΑΝΑΦΗ"
  },
  {
    "zip": "840 10",
    "city": "ΣΙΚΙΝΟΣ"
  },
  {
    "zip": "840 11",
    "city": "ΦΟΛΕΓΑΝΔΡΟΣ"
  },
  {
    "zip": "841 00",
    "city": "ΣΥΡΟΣ"
  },
  {
    "zip": "842 00",
    "city": "ΤΗΝΟΣ"
  },
  {
    "zip": "843 00",
    "city": "ΝΑΞΟΣ"
  },
  {
    "zip": "843 02",
    "city": "ΦΙΛΟΤΙ"
  },
  {
    "zip": "844 00",
    "city": "ΠΑΡΟΣ"
  },
  {
    "zip": "844 01",
    "city": "ΝΑΟΥΣΑ ΠΑΡΟΥ"
  },
  {
    "zip": "845 00",
    "city": "ΑΝΔΡΟΣ"
  },
  {
    "zip": "845 01",
    "city": "ΓΑΥΡΙΟ"
  },
  {
    "zip": "846 00",
    "city": "ΜΥΚΟΝΟΣ"
  },
  {
    "zip": "847 00",
    "city": "ΘΗΡΑ"
  },
  {
    "zip": "847 02",
    "city": "ΟΙΑ"
  },
  {
    "zip": "847 03",
    "city": "ΕΜΠΟΡΕΙΟΝ"
  },
  {
    "zip": "848 00",
    "city": "ΜΗΛΟΣ"
  },
  {
    "zip": "850 01",
    "city": "ΛΕΙΨΟΙ"
  },
  {
    "zip": "850 02",
    "city": "ΤΗΛΟΣ"
  },
  {
    "zip": "850 03",
    "city": "ΑΓΑΘΟΝΗΣΙ"
  },
  {
    "zip": "851 01",
    "city": "ΙΑΛΥΣΟΣ"
  },
  {
    "zip": "851 02",
    "city": "ΑΡΧΑΓΓΕΛΟΣ"
  },
  {
    "zip": "851 03",
    "city": "ΑΦΑΝΤΟΥ"
  },
  {
    "zip": "851 04",
    "city": "ΚΡΕΜΑΣΤΗ"
  },
  {
    "zip": "851 05",
    "city": "ΚΑΛΥΘΙΕΣ"
  },
  {
    "zip": "851 06",
    "city": "ΠΑΡΑΔΕΙΣΙ"
  },
  {
    "zip": "851 07",
    "city": "ΛΙΝΔΟΣ"
  },
  {
    "zip": "851 08",
    "city": "ΕΜΠΩΝΑΣ"
  },
  {
    "zip": "851 09",
    "city": "ΓΕΝΝΑΔΙ"
  },
  {
    "zip": "851 10",
    "city": "ΧΑΛΚΗ"
  },
  {
    "zip": "851 11",
    "city": "ΜΕΓΙΣΤΗ"
  },
  {
    "zip": "851 31",
    "city": "ΡΟΔΟΣ"
  },
  {
    "zip": "851 32",
    "city": "ΡΟΔΟΣ"
  },
  {
    "zip": "851 33",
    "city": "ΡΟΔΟΣ"
  },
  {
    "zip": "851 50",
    "city": "ΡΟΔΟΣ"
  },
  {
    "zip": "852 00",
    "city": "ΚΑΛΥΜΝΟΣ"
  },
  {
    "zip": "853 00",
    "city": "ΚΩΣ"
  },
  {
    "zip": "853 01",
    "city": "ΚΕΦΑΛΟΣ"
  },
  {
    "zip": "853 02",
    "city": "ΑΝΤΙΜΑΧΕΙΑ"
  },
  {
    "zip": "853 03",
    "city": "ΝΙΣΥΡΟΣ"
  },
  {
    "zip": "854 00",
    "city": "ΛΕΡΟΣ"
  },
  {
    "zip": "855 00",
    "city": "ΠΑΤΜΟΣ"
  },
  {
    "zip": "856 00",
    "city": "ΣΥΜΗ"
  },
  {
    "zip": "857 00",
    "city": "ΚΑΡΠΑΘΟΣ"
  },
  {
    "zip": "858 00",
    "city": "ΚΑΣΟΣ"
  },
  {
    "zip": "859 00",
    "city": "ΑΣΤΥΠΑΛΑΙΑ"
  }
]');

function rs($string){
return str_replace(' ', '', $string);
}

$limit = ($_REQUEST['limit']!=""?$_REQUEST['limit']:20);
$skip = ($_REQUEST['skip']!=""?$_REQUEST['skip']:0);

$tk = ($_REQUEST['tk']!=""?$_REQUEST['tk']:"");

if ($tk!=""){
	foreach($tks as $key => $tkv){
    if(strpos(rs($tkv->zip) ,rs($tk))!== false){
         $selectedTk[] = $tkv;
    }
}

if(isset($selectedTk)){
print json_encode(array_slice ($selectedTk,$skip,$limit));
}
}
else print json_encode(array_slice ($tks,$skip,$limit));



}
