<?php
header('Access-Control-Allow-Origin: *');
header('Access-Control-Allow-Headers: *');
header('Access-Control-Allow-Methods: GET, OPTIONS');
header('Content-type: application/json');
header('Cache-Control: no-cache, must-revalidate');




if ($_SERVER['REQUEST_METHOD'] === 'OPTIONS') {
	exit;
} else
if ($_SERVER['REQUEST_METHOD'] === 'GET') {

	
$ref = $_SERVER['HTTP_REFERER'];
$refData = parse_url($ref);

if($refData['host'] !== 'formio-api'&&$refData['host'] !== 'efiling.obi.gr') { //TODO allow internal obi network
	    $data['status']="error";
	    $data['error']="not in net";
		$data["Forbidden"] = 1;
		header("HTTP/1.1 403 Forbidden");
		die(json_encode($data));	
}

$ydrimata=json_decode('
[
{"ydrima":"ΑΘΗΝΑ-ΕΡΕΥΝΗΤΙΚΟ ΚΕΝΤΡΟ ΚΑΙΝΟΤΟΜΙΑΣ ΣΤΙΣ ΤΕΧΝΟΛΟΓΙΕΣ ΤΗΣ ΠΛΗΡΟΦΟΡΙΑΣ, ΤΩΝ ΕΠΙΚΟΙΝΩΝΙΩΝ ΚΑΙ ΤΗΣ ΓΝΩΣΗΣ με δ.τ. \'ΑΘΗΝΑ\'"},
{"ydrima":"ΑΛΕΞΑΝΔΡΕΙΟ ΤΕΧΝΟΛΟΓΙΚΟ ΕΚΠΑΙΔΕΥΤΙΚΟ ΙΔΡΥΜΑ ΘΕΣΣΑΛΟΝΙΚΗΣ (ΑΤΕΙΘ)"},
{"ydrima":"ΑΛΕΞΑΝΔΡΕΙΟ ΤΕΧΝΟΛΟΓΙΚΟ ΕΚΠΑΙΔΕΥΤΙΚΟ ΙΔΡΥΜΑ ΘΕΣΣΑΛΟΝΙΚΗΣ-ΕΠΙΤΡΟΠΗ ΕΡΕΥΝΩΝ"},
{"ydrima":"ΑΡΙΣΤΟΤΕΛΕΙΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΘΕΣΣΑΛΟΝΙΚΗΣ - ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΚΟΝΔΥΛΙΩΝ ΕΡΕΥΝΑΣ"},
{"ydrima":"ΑΣΤΙΚΗ ΜΗ ΚΕΡΔΟΣΚΟΠΙΚΗ ΕΤΑΙΡΕΙΑ ΕΠΙΣΤΗΜΟΝΙΚΗΣ ΕΡΕΥΝΑΣ ΚΑΙ ΕΚΠΑΙΔΕΥΣΗΣ - ΑΡΓΩ"},
{"ydrima":"ΓΕΩΠΟΝΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΑΘΗΝΩΝ"},
{"ydrima":"ΓΕΩΠΟΝΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΑΘΗΝΩΝ - ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΚΟΝΔΥΛΙΩΝ ΕΡΕΥΝΑΣ"},
{"ydrima":"ΔΗΜΟΚΡΙΤΕΙΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΘΡΑΚΗΣ-ΔΠΘ"},
{"ydrima":"ΕΘΝΙΚΟ ΙΔΡΥΜΑ ΕΡΕΥΝΩΝ (ΕΙΕ)"},
{"ydrima":"ΕΘΝΙΚΟ ΚΑΙ ΚΑΠΟΔΙΣΤΡΙΑΚΟ ΠΑΝΕΠΙΣΤΗΜΙΟ ΑΘΗΝΩΝ"},
{"ydrima":"ΕΘΝΙΚΟ ΚΕΝΤΡΟ ΕΡΕΥΝΑΣ ΚΑΙ ΤΕΧΝΟΛΟΓΙΚΗΣ ΑΝΑΠΤΥΞΗΣ (ΕΚΕΤΑ)"},
{"ydrima":"ΕΘΝΙΚΟ ΚΕΝΤΡΟ ΕΡΕΥΝΑΣ ΚΑΙ ΤΕΧΝΟΛΟΓΙΚΗΣ ΑΝΑΠΤΥΞΗΣ (ΕΚΕΤΑ)/ΙΝΣΤΙΤΟΥΤΟ ΧΗΜΙΚΩΝ ΔΙΕΡΓΑΣΙΩΝ ΚΑΙ ΕΝΕΡΓΕΙΑΚΩΝ ΠΟΡΩΝ (ΙΔΕΠ)"},
{"ydrima":"ΕΘΝΙΚΟ ΚΕΝΤΡΟ ΕΡΕΥΝΑΣ ΚΑΙ ΤΕΧΝΟΛΟΓΙΚΗΣ ΑΝΑΠΤΥΞΗΣ / ΙΝΣΤΙΤΟΥΤΟ ΠΛΗΡΟΦΟΡΙΚΗΣ ΚΑΙ ΤΗΛΕΜΑΤΙΚΗΣ"},
{"ydrima":"ΕΘΝΙΚΟ ΚΕΝΤΡΟ ΕΡΕΥΝΑΣ ΚΑΙ ΤΕΧΝΟΛΟΓΙΚΗΣ ΑΝΑΠΤΥΞΗΣ/ΙΝΣΤΙΤΟΥΤΟ ΤΕΧΝΟΛΟΓΙΩΝ ΠΛΗΡΟΦΟΡΙΚΗΣ ΚΑΙ ΕΠΙΚΟΙΝΩΝΙΩΝ"},
{"ydrima":"ΕΘΝΙΚΟ ΚΕΝΤΡΟ ΕΡΕΥΝΑΣ ΦΥΣΙΚΩΝ ΕΠΙΣΤΗΜΩΝ (Ε.Κ.Ε.Φ.Ε.) \'ΔΗΜΟΚΡΙΤΟΣ\'"},
{"ydrima":"ΕΘΝΙΚΟ ΜΕΤΣΟΒΙΟ ΠΟΛΥΤΕΧΝΕΙΟ"},
{"ydrima":"ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΕΡΕΥΝΑΣ (ΕΛΕ) ΕΘΝΙΚΟΥ ΜΕΤΣΟΒΙΟΥ ΠΟΛΥΤΕΧΝΕΙΟΥ (ΕΜΠ)"},
{"ydrima":"ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΠΑΝΕΠΙΣΤΗΜΙΟΥ ΚΡΗΤΗΣ"},
{"ydrima":"ΕΚΕΦΕ \'ΔΗΜΟΚΡΙΤΟΣ\' "},
{"ydrima":"ΕΚΕΦΕ \'ΔΗΜΟΚΡΙΤΟΣ\' ΝΠΔΔ"},
{"ydrima":"ΕΚΕΦΕ \'ΔΗΜΟΚΡΙΤΟΣ\', ΙΝΣΤΙΤΟΥΤΟ ΜΙΚΡΟΗΛΕΚΤΡΟΝΙΚΗΣ "},
{"ydrima":"ΕΛΛΗΝΙΚΟ ΑΝΟΙΧΤΟ ΠΑΝΕΠΙΣΤΗΜΙΟ"},
{"ydrima":"ΕΛΛΗΝΙΚΟ ΓΕΩΡΓΙΚΟ ΟΡΓΑΝΙΣΜΟ -ΔΗΜΗΤΡΑ"},
{"ydrima":"ΕΛΛΗΝΙΚΟ ΚΕΝΤΡΟ ΘΑΛΑΣΣΙΩΝ ΕΡΕΥΝΩΝ (ΕΛ.ΚΕ.ΘΕ.)"},
{"ydrima":"ΕΠΙΤΡΟΠΗ ΕΡΕΥΝΩΝ ΚΑΙ ΕΚΠΑΙΔΕΥΣΗΣ ΤΕΙ ΘΕΣΣΑΛΙΑΣ"},
{"ydrima":"ΕΠΙΤΡΟΠΗ ΕΡΕΥΝΩΝ ΠΑΝΕΠΙΣΤΗΜΙΟΥ ΙΩΑΝΝΙΝΩΝ (Ε.Λ.Κ.Ε.)"},
{"ydrima":"ΕΠΙΤΡΟΠΗ ΕΡΕΥΝΩΝ ΤΟΥ ΤΕΧΝΟΛΟΓΙΚΟΥ ΕΚΠΑΙΔΕΥΤΙΚΟΥ ΙΔΡΥΜΑΤΟΣ (ΤΕΙ) ΔΥΤΙΚΗΣ ΜΑΚΕΔΟΝΙΑΣ"},
{"ydrima":"ΕΡΕΥΝΗΤΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΑΚΟ ΙΝΣΤΙΤΟΥΤΟ ΣΥΣΤΗΜΑΤΩΝ ΕΠΙΚΟΙΝΩΝΙΩΝ ΚΑΙ ΥΠΟΛΟΓΙΣΤΩΝ (ΕΠΙΣΕΥ) ΕΘΝΙΚΟΥ ΜΕΤΣΟΒΙΟΥ ΠΟΛΥΤΕΧΝΕΙΟΥ ΕΜΠ"},
{"ydrima":"ΕΡΕΥΝΗΤΙΚΟ ΠΑΝΕΠΙΣΤΗΜΙΑΚΟ ΙΝΣΤΙΤΟΥΤΟ ΤΗΛΕΠΙΚΟΙΝΩΝΙΑΚΩΝ ΣΥΣΤΗΜΑΤΩΝ-ΕΠΙΤΣ"},
{"ydrima":"ΙΔΡΥΜΑ ΙΑΤΡΟΒΙΟΛΟΓΙΚΩΝ ΕΡΕΥΝΩΝ ΑΚΑΔΗΜΙΑΣ ΑΘΗΝΩΝ"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ (ΙΤΕ)"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ - ΕΡΕΥΝΗΤΙΚΟ ΙΝΣΤΙΤΟΥΤΟ ΧΗΜΙΚΗΣ ΜΗΧΑΝΙΚΗΣ & ΧΗΜΙΚΩΝ ΔΙΕΡΓΑΣΙΩΝ ΥΨΗΛΗΣ ΘΕΡΜΟΚΡΑΣΙΑΣ (ΙΤΕ/ΕΙΧΗΜΥΘ)"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ-ΙΝΣΤΙΤΟΥΤΟ ΗΛΕΚΤΡΟΝΙΚΗΣ ΔΟΜΗΣ"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ-ΙΝΣΤΙΤΟΥΤΟ ΗΛΕΚΤΡΟΝΙΚΗΣ ΔΟΜΗΣ ΚΑΙ ΛΕΙΖΕΡ"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΕΡΕΥΝΑΣ - ΙΝΣΤΙΤΟΥΤΟ ΒΙΟΙΑΤΡΙΚΩΝ ΕΡΕΥΝΩΝ"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ - ΙΝΣΤΙΤΟΥΤΟ ΜΟΡΙΑΚΗΣ ΒΙΟΛΟΓΙΑΣ ΚΑΙ ΒΙΟΤΕΧΝΟΛΟΓΙΑΣ"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ -ΕΡΕΥΝΗΤΙΚΟ ΙΝΣΤΙΤΟΥΤΟ ΧΗΜΙΚΗΣ ΜΗΧΑΝΙΚΗΣ ΚΑΙ ΧΗΜΙΚΩΝ ΔΙΕΡΓΑΣΙΩΝ ΥΨΗΛΗΣ ΘΕΡΜΟΚΡΑΣΙΑΣ"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ - ΙΝΣΤΙΤΟΥΤΟ ΕΠΙΣΤΗΜΩΝ ΧΗΜΙΚΗΣ ΜΗΧΑΝΙΚΗΣ "},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ -  ΕΡΕΥΝΗΤΙΚΟ ΙΝΣΤΙΤΟΥΤΟ ΧΗΜΙΚΗΣ ΜΗΧΑΝΙΚΗΣ ΚΑΙ ΧΗΜΙΚΩΝ ΔΙΕΡΓΑΣΙΩΝ ΥΨΗΛΗΣ ΘΕΡΜΟΚΡΑΣΙΑΣ"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ-ΙΝΣΤΙΤΟΥΤΟ ΠΛΗΡΟΦΟΡΙΚΗΣ (ΙΤΕ/ΙΠ)"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ - ΕΡΕΥΝΗΤΙΚΟ ΙΝΣΤΙΤΟΥΤΟ ΤΕΧΝΙΚΗΣ ΧΗΜΙΚΩΝ ΔΙΕΡΓΑΣΙΩΝ"},
{"ydrima":"ΙΝΣΤΙΤΟΥΤΟ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ"},
{"ydrima":"ΙΔΡΥΜΑ ΤΕΧΝΟΛΟΓΙΑΣ ΚΑΙ ΕΡΕΥΝΑΣ- ΙΝΣΤΙΤΟΥΤΟ ΕΠΙΣΤΗΜΩΝ ΧΗΜΙΚΗΣ ΜΗΧΑΝΙΚΗΣ (ΙΤΕ/ΙΕΧΜΗ)"},
{"ydrima":"ΜΕΣΟΓΕΙΑΚΟ ΑΓΡΟΝΟΜΙΚΟ ΙΝΣΤΙΤΟΥΤΟ ΧΑΝΙΩΝ (ΜΑΙΧ)"},
{"ydrima":"ΠΑΝΕΠΙΣΤΗΜΙΟ ΘΕΣΣΑΛΙΑΣ"},
{"ydrima":"ΠΑΝΕΠΙΣΤΗΜΙΟ ΘΕΣΣΑΛΙΑΣ-ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΚΟΝΔΥΛΙΩΝ ΕΡΕΥΝΑΣ ΤΟΥ ΠΕΝΕΠΙΣΤΗΜΙΟΥ ΘΕΣΣΑΛΙΑΣ"},
{"ydrima":"ΠΑΝΕΠΙΣΤΗΜΙΟ ΙΩΑΝΝΙΝΩΝ"},
{"ydrima":"ΠΑΝΕΠΙΣΤΗΜΙΟ ΚΡΗΤΗΣ"},
{"ydrima":"ΠΑΝΕΠΙΣΤΗΜΙΟ ΚΡΗΤΗΣ - ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΚΟΝΔΥΛΙΩΝ ΕΡΕΥΝΑΣ"},
{"ydrima":"ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΚΟΝΔΥΛΙΩΝ ΕΡΕΥΝΑΣ ΠΑΝΕΠΙΣΤΗΜΙΟΥ ΚΡΗΤΗΣ"},
{"ydrima":"ΠΑΝΕΠΙΣΤΗΜΙΟ ΠΑΤΡΩΝ"},
{"ydrima":"ΠΟΛΥΤΕΧΝΕΙΟ ΚΡΗΤΗΣ"},
{"ydrima":"ΠΟΛΥΤΕΧΝΕΙΟ ΚΡΗΤΗΣ - ΕΙΔΙΚΟΣ ΛΟΓΑΡΙΑΣΜΟΣ ΚΟΝΔΥΛΙΩΝ ΕΡΕΥΝΑΣ"},
{"ydrima":"ΤΕΙ ΜΕΣΟΛΟΓΓΙΟΥ"},
{"ydrima":"ΤΕΧΝΟΛΟΓΙΚΟ ΕΚΠΑΙΔΕΥΤΙΚΟ ΙΔΡΥΜΑ ΑΝΑΤΟΛΙΚΗΣ ΜΑΚΕΔΟΝΙΑΣ ΚΑΙ ΘΡΑΚΗΣ"},
{"ydrima":"ΤΕΧΝΟΛΟΓΙΚΟ ΕΚΠΑΙΔΕΥΤΙΚΟ ΙΔΡΥΜΑ ΔΥΤΙΚΗΣ ΜΑΚΕΔΟΝΙΑΣ"}
]');


function rs($string){

return str_replace(' ', '', $string);
}

$limit = ($_REQUEST['limit']!=""?$_REQUEST['limit']:20);
$skip = ($_REQUEST['skip']!=""?$_REQUEST['skip']:0);

$ydrimaq = ($_REQUEST['ydrima']!=""?$_REQUEST['ydrima']:"");

if ($ydrimaq!=""){
	foreach($ydrimata as $ydrima => $ydrimav){
        

    if(strpos(rs($ydrimav->ydrima) ,rs($ydrimaq))!== false){
         $selectedYdrima[] = $ydrimav;
    }
}
}

if(isset($selectedYdrima)){
print json_encode(array_slice($selectedYdrima,$skip,$limit));
}
else print json_encode(array_slice($ydrimata,$skip,$limit));


}
//print '[{"ydrima":"aaa"}]';

